#Requires AutoHotkey v2.0

DOCTOR_RANK := "7"
DOCTOR_NAME := "Alex Aspero"
STATIC_ID := "46746"

DOCTORS_BADGE := "[EMS | " DOCTOR_RANK " | " DOCTOR_NAME " | № " STATIC_ID "]"


; ====================================================================
; Array with text variations for showing a doctor's badge
;
BADGE_VARIATIONS := [
    [
        text("/do На грудях закріплений бейджик " DOCTORS_BADGE)
    ]
]


; ====================================================================
; Array with text variations for selling tablets blister
;
DRUGS_BLISTER_VARIATIONS := [
    [
        text("/me з сумкою медикаментів на плечі дістає блістер і передає людині навпроти")
    ],
    [
        text("/me витягує з сумки на плечі аптечку і відкриває її, дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку седативного, дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Парацетамол`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Ношпа`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Нурофен`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Ібупрофен`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Веселі вітамінки`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"A`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"B6`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"B12`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"C`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"D`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"E`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"Мультітабс`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з капсулами `"OMEGA-3`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з аскорбінкою і передає її людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з рожевими пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер із синіми пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з жовтими пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з зеленими пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з червоними пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер жувальними вітамінами і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами із фруктовим смаком і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами з яблучним смаком і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами з апельсиновим смаком і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами із полуничним смаком і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами з банановим смаком і передає людині навпроти")
    ]
]


; ====================================================================
; Array with text variations for selling/healing with vitamins
;
DRUGS_VITAMIN_VARIATIONS := [
    [
        text("/me з сумкою медикаментів на плечі дістає контейнер з вітамінами, витягує вітамінку передає і людині навпроти")
    ],
    [
        text("/me дістає з кишені маленьку червону вітамінку і передає її людині навпроти")
    ],
    [
        text("/me дістає з кишені маленьку синю вітамінку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін А`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін С`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін D`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін E`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін B6`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін B12`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені упаковку з надписом `"Мультітабс`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку і відкриває її, дістає капсулу з вітамінами і передає її людині навпроти"),
        text("/do капсула має зелений колір і ледь помітно світиться у темряві", 200)
    ],
    [
        text("/me витягує з сумки аптечку і відкриває її, дістає капсулу з вітамінами і передає її людині навпроти"),
        text("/do капсула має жовтий колір і, здається, трохи вібрує", 200)
    ],
    [
        text("/me витягує з сумки аптечку і відкриває її, дістає капсулу з вітамінами і передає її людині навпроти"),
        text("/do капсула дуже липка і має червоний колір", 200)
    ],
    [
        text("/me відкриває маленький контейнер `"Весела Вітамінка`" і, посміхаючись, передає пігулку пацієнту")
    ],
    [
        text("/me відкриває маленький контейнер `"Смачна Порція Здоров'я`" і передає пігулку пацієнту")
    ],
    [
        text("/me відкриває маленький контейнер `"Радісний Вітамінчик`" і передає пігулку пацієнту")
    ],
    [
        text("/me відкриває маленький контейнер `"Вітаміни Для Всієї Родини`" і передає пігулку пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі аптечку і відкриває її, дістає капсулу з вітамінами і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки на плечі інжектор з вітамінами, обирає правильну дозу, і вколює людині навпроти")
    ],
    [
        text("/me витягує з сумки на плечі гематоген та передає людині навпроти")
    ],
    [
        text("/me витягує з сумки на плечі аптечку і відкриває її, дістає пігулку аскорбінки і передає пацієнту")
    ],
]


; ====================================================================
; Array with text variations blood donation from patient
;
BLOOD_DONATION_VARIATIONS := [
    [
        text("/do Дістаю обладнання для забирання крові",, 300),
        text("/do Перевіряю наявність всього необхідного для забирання крові (інструменти, рукавички, дезінфікуючі засоби)",, 300),
        text("/me просунув голку у вену донора та забирав необхідну кількість крові", 150, 300),
        text("/me зняв голку та наклав стерильний бинт на місце уколу", 300, 300),
        text("/do Прикладаю ватку зі спиртом на місце уколу та тримаю його декілька хвилин, щоб зупинити кровотік",,1000),
        text("/me завершив забирання крові у пацієнта")
    ],
    [
        text("/me дістає обладнання для забирання крові"),
        text("/me перевіяє наявність всього необхідного для забирання крові", 300),
        text("/me зробив прокол вени за допомогоє голки і почав збирати кров", 300),
        text("/me дістав голку та наклав стерильний бинт на місце проколу", 3000),
        text("/me прикладає ватку зі спиртом на місце проколу та тримаю його декілька хвилин, щоб зупинити кровотік", 300),
        text("/me завершив забирання крові у пацієнта", 400),
    ],
    [
        text("/me дістає обладнання для забирання крові"),
        text("/me надягає стерильні рукавички", 400),
        text("/me ретельно вивчає доступні вени та обирає найліпшу для процедури і робить прокол", 400),
        text("/do Кров починає перетікати у гемокон", 300),
        text("/do Гемокон виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає стерильний бинт до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me вимірює тиск пацієнта та перевіряє його пульс для оцінки загального стану здоров'я"),
        text("/do Пацієнт вигляє цілком здоровим", 500),
        text("/me дістає обладнання для забирання крові", 1000),
        text("/me дезінфікує місце проколу для запобігання інфекціям.", 1000),
        text("/me використовує голку для проколу вени на лівій руці, фіксує її та підключає до системи збору крові", 300),
        text("/do Кров починає перетікати у гемокон", 500),
        text("/do Гемокон виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає змочену спиртом ватку до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me вимірює тиск пацієнта та перевіряє його пульс для оцінки загального стану здоров'я"),
        text("/do Пацієнт вигляє цілком здоровим", 500),
        text("/me дістає обладнання для забирання крові", 1000),
        text("/me дезінфікує місце проколу для запобігання інфекціям.", 1000),
        text("/me використовує голку для проколу вени на лівій руці, фіксує її та підключає до системи збору крові", 300),
        text("/do Кров починає перетікати у гемокон", 500),
        text("/do Гемокон виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає змочену спиртом ватку до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me вимірює тиск пацієнта та перевіряє його пульс для оцінки загального стану здоров'я"),
        text("/do Пацієнт вигляє цілком здоровим", 500),
        text("/me дістає обладнання для забирання крові", 1000),
        text("/me використовує голку для проколу вени на правій руці, фіксує її та підключає до системи збору крові", 1000),
        text("/do Кров починає перетікати у герметичний контейнер", 450),
        text("/do Контейнер виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає змочену спиртом ватку до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me вимірює тиск пацієнта та перевіряє його пульс для оцінки загального стану здоров'я"),
        text("/do Пацієнт вигляє цілком здоровим", 500),
        text("/me дістає обладнання для забирання крові", 1000),
        text("/me використовує голку для проколу вени на правій руці, фіксує її та підключає до системи збору крові", 1000),
        text("/do Голка зіскакує і краплі крові розлітаються по салону авто", 1000),
        text("/me швидко поправляє голку і витирає зі свого обличчя кров пацієнта", 1000),
        text("/do Кров починає перетікати у герметичний контейнер", 300),
        text("/do Гемокон виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає змочену спиртом ватку до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me дістає обладнання для забирання крові"),
        text("/me перевіряє наявність всього необхідного для забирання крові", 500),
        text("/me зробив голкою прокол вени і почав збір крові", 500),
        text("/do Обличчя пацієнта раптово стає блідим і він втрачає свідомість", 1000),
        text("/me дістав нашатирний спирт і провів кілька разів під носом у пацієнта", 600),
        text("/do Пацієнт опритомнів", 2000),
        text("/me від'єднує голку та прикладає стерильний бинт до місця проколу", 500),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
]


; ====================================================================
; Array with text variations for person reanimation
;
REANIMATION_VARIATIONS := [
    [
        text("/me оцінює наявність пульсу у постраждалого"),
        text("/do Пульс відсутній, терміново потрібно розпочати реанімаційні заходи", 500),
        text("/me дістає з сумки на плечі дефибрилятор і підготовлює його до використання", 500),
        text("/do Дефибрилятор зарядженний", 600),
        text("/me робить розряд дефибрилятора на грудях постраждалого", 600),
        text("/do Постраждалий поступово подає ознаки життя і приходить до тями", 800),
    ],
    [
        text("/me перевіряє наявність ознак життя та визначає наявність дихання у постраждалого"),
        text("/do Oзнаки дихання відсутні", 1000),
        text("/me розпочинає тиснути на грудну клітину відповідно до протоколу реанімації", 800),
        text("/do Постраждалий повертається до свідомості", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя та визначає наявність дихання у постраждалого"),
        text("/do Oзнаки дихання відсутні", 700),
        text("/me починає виконувати непрямий масаж серця", 500),
        text("/do Серцевий ритм відновлюється, пацієнт може самостійно дихати", 800),
        text("/do Постраждалий повертається до свідомості", 1000),
    ],
    [
        text("/me оцінює наявність пульсу у постраждалого"),
        text("/do Пульс відсутній, можлива зупинка серця", 700),
        text("/me дістає з сумки на плечі шприц із адреналіном і робить інʼєкцію в серце", 500),
        text("/me починає непрямий масаж серця", 800),
        text("/do Серцевий ритм відновлються, пацієнт приходить до свідомості", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя у постраждалого"),
        text("/do Пульс та дихання присутні", 1000),
        text("/me дістає з сумки на плечі тампон із нашатирим спиртом", 600),
        text("/me кілька разів проводить тампоном під носом у постраждалого", 800),
        text("/do Постраждалий опритомнює", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя та визначає наявність дихання у постраждалого"),
        text("/do Oзнаки дихання відсутні", 700),
        text("/me дістає із сумки на плечі вентиляційний балон", 500),
        text("/me починає проводити штучну вентиляцію легень", 800),
        text("/do Дихання відновлюється, пацієнт опритомнює", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя у постраждалого"),
        text("/do Пульс та дихання присутні, на постраждалому присутні сліди забиття", 700),
        text("/me дістає з сумки на шприц із морфієм", 500),
        text("/me робить інʼєкцію у вену на руці постраждалого", 800),
        text("/do Постраждалий повертається до свідомісті", 1000),
    ],
    [
        text("/me оцінює стан постраждалого"),
        text("/do Пульс відсутній, можлива зупинка серця", 700),
        text("/me дістає з сумки на плечі дефибрилятор і прикріплює електроди на грудях постраждалого", 500),
        text("/do Дефибрилятор заряджений", 800),
        text("/me робить розряд дефибрилятора", 500),
        text("/do Життєві функції відновлені, пацієнт приходить до тями", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя у постраждалого"),
        text("/do Пульс та дихання присутні, на постраждалому присутні ознаки забиття", 700),
        text("/me дістає з сумки на шприц із норадреналіном", 500),
        text("/me робить інʼєкцію у вену на руці постраждалого", 800),
        text("/do Постраждалий повертається до свідомісті", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя у постраждалого"),
        text("/do Пульс та дихання присутні, на постраждалому присутні ознаки забиття", 700),
        text("/me дістає з сумки на шприц із анальгіном", 500),
        text("/me робить інʼєкцію у вену на руці постраждалого", 800),
        text("/do Постраждалий поступово повертається до свідомісті", 1000),
    ],
]


; ====================================================================
; Array with text variations for med card body temperature check
;
MED_CARD_TEMPERATURE_CHECK_VARIATIONS := [
    [
        text("/do На столі лежить пірометр"),
        text("/me протягнув руку до столу та взяв пірометр", 500),
        text("/do Пірометр в руках", 500),
        text("/me направив пірометр на чоло", 1000),
        text("/do Пірометр показав - 36.6", 1000),
        text("/me поклав пірометр на стіл", 500),
    ]
]


; ====================================================================
; Array with text variations for med card throat check
;
MED_CARD_THROAT_CHECK_VARIATIONS := [
    [
        text("/do Дерев'яний шпатель лежить на столі"),
        text("/me взяв зі стола одноразовий шпатель", 500),
        text("/me обережно поклав шпатель в ротову порожнину та почав огляд", 500),
        text("/do Патології відсутні", 1000),
        text("/me дістав шпатель та викинув у смітник",1000),
    ]
]


; ====================================================================
; Array with text variations for med lungs check
;
MED_CARD_LUNGS_CHECK_VARIATIONS := [
    [
        text("/do Стетоскоп висить на шиї"),
        text("/me зняв стетоскоп та почав вислуховування", 500),
        text("/do Патологій не виявлено, легені чисті", 1000),
        text("/me повісив стетоскоп на шию", 1000),
    ]
]


; ====================================================================
; Array with text variations for med signing
;
MED_CARD_SIGN_VARIATIONS := [
    [
        text("/do Чистий бланк медичної карти лежить на столі"),
        text("/me взяв чистий бланк та почав вносити інформацію", 500),
        text("/do Бланк медичної картки заповнено", 1000),
        text("/me передав заповнений бланк пацієнту", 1000),
    ]
]


; ====================================================================
; Array with text variations while can't find a body
;
CANT_FIND_A_BODY_VARIATIONS := [
    [
        text("/me вічуває наявність аномалій на місці подій"),
        text("/do Постраждалий наче розчинився у повітрі", 500),
        text("/b Не можу вас побачити, і почути - напишіть в чат /b де саме вас шукати", 1000),
        text("/b Я побачу вас тільки коли торкнуся я або хтось інший", 500),
    ]
]


; ====================================================================
; Array with text variations for blood analysis
;
ANALYSIS_BLOOD_VARIATIONS := [
    [
        text("/me почав підготовку для проведення аналізу крові"),
        text("/do На столі лежать стерильна голка та пробірка", 500),
        text("/me взяв руку пацієнта, обробив палець спиртом", 1000),
        screenshot(),
        text("/me зробив прокол на мальці і почав збір крові у пробірку", 1000),
        text("/do Пробірка повністню заповнена", 1000),
        text("/me вставив пробірку із кровʼю в апарат і запустив тест", 1000),
        screenshot(),
        text("/do Прилад завершив обробку і почав друк результатів", 1000),
    ]
]


; ====================================================================
; Array with text variations for blood pressure analysis
;
ANALYSIS_BLOOD_PRESSURE_VARIATIONS := [
    [
        text("/do Пацієнт у сидячому положенні"),
        text("/do В сумці лежить сфігноманометр"),
        text("/me взяв сфігноманометр в праву руку та одягнув манжету на ліву руку пацієнта."),
        screenshot(),
        text("/do Манжет міцно зафіксований на нижній частині плеча вище ліктьового суглобу"),
        text("/me почала зжимати нагнітатель повітря, тим самим накачувати манжет."),
        text("/do Лікар повторв дію декілька раз"),
        text("/do Через деякий час манометр показав результати вимірювання тиску"),
        text("/try Тиск пацієнта в нормі"),
        screenshot(),
        text("/me натиснув на клапан і випустив повітря з манжету."),
        text("/me розстібнув ліпучку манжета, після чого зняв її, та поклав назад в сумку."),
        text("/do сфігноманометр лежить в сумці"),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for plastic surgery
;
PLASCTIC_SURGERY_VARIATIONS := [
    [
        text("/do Підготовка до операції. Чистий хірургічний одяг та рукавички одягнені", 2000),
        text("/me заходжу в операційну залу та вмикає світло над пацієнтом", 2000),
        text("/do Пацієнт за усіма правилами підготовлений до операції", 2000),
        screenshot(),
        text("/me дістаю необхідні інструменти та готую їх до використання", 2000),
        text("/do Починається операція", 2000),
        text("/me дістаю ножі та інші інструменти та починаю проводити операцію", 2000),
        screenshot(),
        text("/do Операція триває деякий час", 2000),
        text("/me завершую операцію та закриваю порізи швами", 2000),
        text("/do Операція успішно завершена. ", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for oculist right eye check
;
OCULIST_RIGHT_EYE_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/do На столі лежать необхідні для перевірки інструменти", 1000),
        text("/me бере зі столу невелику баночку з мідріатичними краплями, що розширюють зіницю.", 1000),
        text("/me крапає до правого ока пацієнта 3 краплі.", 1000),
        text("/do Зіниця правого ока пацієнта розширена.", 1000),
        screenshot(),
        text("/me у правій руці тримає офтальмоскоп, поступово приближуючі його до правого ока пацієнта.", 3000),
        text("/do Промінь світла прямує прямо в зіницю", 2000),
        text("/do Прилад збільшує картинку в 16 разів", 1500),
        screenshot(),
        text("/me уважно розглядає сітківку ока пацієнта.", 1000),
        text("/try Ретинит (запалення сітківки) виявлено", 1500),
        text("/try Периферична дистрофія сітківки виявлена", 1500),
        text("/try Диск зорового нерва має блідо-рожевий відтінок з чіткими та рівними межами", 1000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for oculist left eye check
;
OCULIST_LEFT_EYE_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/do На столі лежать необхідні для перевірки інструменти", 1000),
        text("/me бере зі столу невелику баночку з мідріатичними краплями, що розширюють зіницю.", 1000),
        text("/me крапає до лівого ока пацієнта 3 краплі.", 3000),
        text("/do Зіниця лівого ока пацієнта розширена.", 2000),
        screenshot(),
        text("/me у правій руці тримає офтальмоскоп, поступово приближуючі його до лівого ока пацієнта.", 3000),
        text("/do Промінь світла прямує прямо в зіницю", 1000),
        text("/do Прилад збільшує картинку в 16 разів", 3000),
        screenshot(),
        text("/me уважно розглядає сітківку ока пацієнта.", 2000),
        text("/try Ретинит (запалення сітківки) виявлено", 3000),
        text("/try Периферична дистрофія сітківки виявлена", 1500),
        text("/try Диск зорового нерва має блідо-рожевий відтінок з чіткими та рівними межами", 1500),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology check
;
STOMATOLOGY_TOOTH_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 2000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для огляду ротової порожнини", 2000),
        text("/me тримає в руках шпатель і дзеркало.", 2000),
        text("/me оглядає загальний стан щелепи пацієнта при зімкнутих зубах.", 2000),
        text("/me піднімає стоматологічним дзеркалом розслаблену нижню і верхню губу.", 2000),
        text("/me злегка відтягуює щоку пацієнта, обстежучи переддень рота.", 2000),
        text("/try Червоні облямівки виявлено", 3000),
        text("/try Проблеми в куточках роту виявлено", 2000),
        text("/try Набряки та припухлість виявлено", 2000),
        screenshot(),
        text("/me переходить до ретельного огляду кожного зуба.", 2000),
        text("/me обережно поветртає голову пацієнта в зручніше положення для огляду.", 3000),
        text("/me легенько піднімаючи верхню губу за допомогою шпателя, оглядає фронтову частину верхнього ряду зубів.", 1500),
        text("/me бере із лотку з інструментами гострий зонд для перевірки якості емалі.", 3000),
        text("/me тримає в руках гострий зонд.", 3000),
        text("/me легенько проводить гострим кінчиком зонду по емалі кожнго зуба.", 3000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок верхнього ряду зубів.", 3000),
        text("/try Каріозні прояви виявлено", 3000),
        screenshot(),
        text("/do Стан зубів верхнього ряду у пацієнта задовільний", 3000),
        text("/me продовжує огляд.", 3000),
        text("/me легенько піднімаючи нижню губу за допомогою шпателя, оглядає фронтову частину нижнього ряду зубів.", 3000),
        text("/me обережно проводить гострим кінчиком зонду по емалі кожнго зуба.", 3000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок нижнього ряду зубів.", 3000),
        text("/try Каріозні прояви виявлено", 3000),
        text("/do Стан зубів нижнього ряду у пацієнта задовільний", 3000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology brackets check
;
STOMATOLOGY_BRACKETS_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 2000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для огляду ротової порожнини", 3000),
        screenshot(),
        text("/me тримає в руках шпатель і дзеркало.", 2000),
        text("/me оглядає загальний стан щелепи пацієнта при зімкнутих зубах.", 2000),
        text("/me піднімає стоматологічним дзеркалом розслаблену нижню і верхню губу.", 3000),
        text("/me злегка відтягуює щоку пацієнта, обстежучи переддень рота.", 2000),
        text("/me переходить до ретельного огляду кожного зуба.", 2000),
        text("/me обережно поветртає голову пацієнта в зручніше положення для огляду.", 3000),
        text("/me легенько піднімаючи верхню губу за допомогою шпателя, оглядає фронтову частину верхнього ряду зубів.", 2000),
        text("/me бере із лотку з інструментами гострий зонд для перевірки якості емалі.", 2000),
        text("/me тримає в руках гострий зонд.", 3000),
        screenshot(),
        text("/me легенько проводить гострим кінчиком зонду по емалі кожнго зуба.", 2000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок верхнього ряду зубів.", 2000),
        text("/do Каріозні прояви не виявлено", 3000),
        text("/do Стан зубів верхнього ряду у пацієнта задовільний", 2000),
        text("/me продовжує огляд.", 2000),
        text("/me легенько піднімаючи нижню губу за допомогою шпателя, оглядає фронтову частину нижнього ряду зубів.", 3000),
        text("/me обережно проводить гострим кінчиком зонду по емалі кожнго зуба.", 2000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок нижнього ряду зубів.", 3000),
        text("/do Каріозні прояви не виявлено", 3000),
        text("/do Стан зубів нижнього ряду у пацієнта задовільний", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology tooth cleaning
;
STOMATOLOGY_TOOTH_CLEANING_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 3000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/me проводить огляд для оцінки та стану зубів і ясен, щоб зрозуміти масштаб роботи та визначити необхідні методи.", 3000),
        text("/do Шприц з розчином анестезії лежить на столі", 2000),
        text("/me дістає з шухляди одноразові голки.", 2000),
        text("/me вставляє голку в шприц з розчином анестезії.", 3000),
        screenshot(),
        text("/me обережно піднімаючи верхню губу стоматологічним дзеркалом, вводить голку в верхнє ясно над шостим зубом зліва.", 2000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/me піднімає дзеркалом верхню губу пацієнта з правої сторони.", 2000),
        text("/me обережно вводить голку в ясно над шостим верхнім зубом.", 3000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/me повторює процедуру на нижній щелепі пацієнта.", 2000),
        text("/do Анестезія введна успішно.", 3000),
        text("/do Слиновідсмоктувач підключений до бор-машини.", 2000),
        text("/me згинає трубку слиновідсмоктувача в  зручне положення.", 2000),
        text("/me встановлює трубку слиновідсмоктувача у рот пацієнта.", 3000),
        text("/me готується до механічної чистки ультразвуком.", 2000),
        text("/me одягає пластикові захисні окуляри.", 2000),
        screenshot(),
        text("/do В бор-машину підключений ультразвуковий скалер із металевою насадкою", 3000),
        text("/me за допомогою апарату починає дію безпосередньо на поверхню емалі.", 2000),
        text("/me починає очищення ясенних кишень.", 2000),
        text("/do Затверділі відкладення дробляться на дрібні фрагменти, які виводяться через слиновідсмоктувач", 3000),
        text("/me прибирає в сторону ультразвуковий скалер із металевою насадкою.", 2000),
        text("/me підготовлює інструменти для видаленням м'ягкого нальоту методом Air Flow.", 2000),
        text("/me готує суміш, що складається з води та круглих гранул кальцію і м’якого порошку гліцину.", 3000),
        text("/me за допомогою спеціального апарату на поверхню зубів потужним струменем розпорошує суміш.", 2000),
        text("/me підбирає рівень абразивності пилки.", 2000),
        text("/me знімає суміш з зубів за допомогою спеціальновизначених насадок.", 3000),
        text("/me поліруює емаль кожного зуба спеціальною пастою, яка також профілактує утворення нальоту.", 2000),
        text("/me наносить спеціальний гель зі фтором для зміцнення зубів.", 2000),
        text("/do Професійна чистка завершена успішно", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology tooth removal
;
STOMATOLOGY_TOOTH_REMOVAL_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 3000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/me проводить огляд для оцінки та стану зуба, щоб зрозуміти масштаб роботи.", 3000),
        text("/do Слиновідсмоктувач підключений до бор-машини.", 2000),
        text("/me згинає трубку слиновідсмоктувача в  зручне положення.", 2000),
        text("/me встановлює трубку слиновідсмоктувача у рот пацієнта.", 3000),
        screenshot(),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для операції", 2000),
        text("/me тримає в руках щипці та тампонаду.", 2000),
        text("/me встановлює тампонаду між щокою та яснами пацієнта.", 3000),
        text("/do Шприц з розчином анестезії лежить на столі.", 2000),
        text("/me дістає з шухляди одноразові голки.", 2000),
        text("/me вставляє голку в шприц з розчином анестезії.", 3000),
        text("/me обережно піднімаючи губу стоматологічним дзеркалом, вводить голку в ясно над зубом.", 2000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/do Анестезія введна успішно.", 3000),
        screenshot(),
        text("/me перевіряє чутливість навколо зуба гострим зондом.", 2000),
        text("/me від'єднує кругову зв'язку кореня за допомогою спеціальних інструментів.", 2000),
        text("/me накладає щічки щипців на зуб.", 3000),
        text("/me просуває щічки щипців до емалевоцементної границі.", 2000),
        text("/me змикає ручки щипців всіма п'ятьма пальцями руки.", 3000),
        text("/me починає вихитувати зуб для видалення із лунки.", 2000),
        text("/do Зуб видалено", 4000),
        text("/me здавлює краї вивільненої лунки.", 3000),
        text("/me вкладає ватний тампон, який затискає всередині.", 2000),
        text("/me починає кюретаж лунки і ушивання.", 3000),
        text("/me завершує процедури, які забезпечать чистоту лунки зуба після видалення і швидке загоєння.", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for tooth X-RAY
;
STOMATOLOGY_TOOTH_X_RAY := [
    [
        text("/do Прилад для рентгенової панорами стоїть біля бор-машини"),
        text("/me піднімає спинку крісла на 90°.", 2000),
        screenshot(),
        text("/me встановлює над пацієнтом ортопантомограф.", 3000),
        text("/me встановлює необхідні параметри програми.", 2000),
        text("/me запускає рентген-апарат.", 3000),
        screenshot(),
        text("/do Рентгенівська трубка обертається і взаємодіє з датчиком", 2000),
        text("/do Трубка зчитує необхідну інформацію і після обробки спеціальною програмою виводить готове зображення на екран", 3000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology bracket setup
;
STOMATOLOGY_BRACKETS_SETUP := [
    [
        text("/me прибирає ортопантомограф від пацієнта."),
        text("/me повертає крісло в зручне положення для подальшої роботи.", 2000),
        text("/me поправляє голову пацієнта.", 3000),
        text("/me направляє світло на щелепу пацієнта.", 2000),
        screenshot(),
        text("/me поверхнево промиває ірригатором ротову порожнину пацієнта.", 2000),
        text("/me встановлює роторозширювач до рота пацієнта.", 3000),
        text("/me готує необхідні інструменти для установки керамічної брекет-системи.", 2000),
        text("/do На столі лежать стоматологічні щипці, спеціальний клей та лоток з замочками", 2000),
        text("/me починає установку брекетів.", 3000),
        screenshot(),
        text("/me з'єднує замочки між собою ортодонтичними дугами.", 2000),
        text("/me на задні зуби фіксує щічні замки та ортодонтичні кільця.", 2000),
        text("/do Керамічна брекет-система успішно встановлена", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology tooth heal
;
STOMATOLOGY_TOOTH_HEAL := [
    [
        text("/me підходить до пацієнта зі спеціальними інструментами та матеріалами для пломбування."),
        text("/me прошу пацієнта відкрити рот і уважно оглядаю зуб, що потребує лікування.", 3000),
        text("/me підготовлює інструменти для очищення карієсу та пломбування зуба.", 2000),
        screenshot(),
        text("/me починає з обробки карієсованої ділянки, використовуючи зубні бори та інші інструменти.", 2000),
        text("/me обережно очищає пошкоджену ділянку від карієсу та збирає видалені матеріали.", 3000),
        text("/me використовує спеціальну композитну суміш для пломбування та наносить її на підготовлену поверхню зуба.", 2000),
        text("/do Композит нанесений на пошкоджену ділянку забезпечує правильну форму та текстуру пломби", 2000),
        screenshot(),
        text("/me закінчує пломбування, обробляючи пломбу спеціальними інструментами для видалення нерівностей.", 3000),
        text("/me перевіряє пломбу за допомогою зубного дзеркала, щоб переконатися, що вона правильно встановлена та не завдає дискомфорту.", 2000),
        text("/do Пломба вставновлена корректно, зуб повністню відновлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for otalaryngology rhinoscopy
;
OTOLARYNGOLOGY_RHINOSCOPY := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/me підходить до пацієнта.", 3000),
        text("/do На голові медицинська шапочка з ліхтариком.", 2000),
        text("/me встановлює розширювач для ніздрів пацієнту", 3000),
        screenshot(),
        text("/do На столі лежить носове дзеркальце.", 2000),
        text("/me бере дзеркальце в руки і починає риноскопію.", 2000),
        text("/try Носові проходи відповідають нормам", 3000),
        text("/try Патології виявлено", 2000),
        screenshot(),
        text("/me прибирає носове дзеркальце на стіл.", 3000),
        text("/me знімає розширювач з носу пацієнта.", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for otalaryngology endoscopy
;
OTOLARYNGOLOGY_ENDOSCOPY := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/me підходить до пацієнта.", 2000),
        text("/do Ендоскоп підключений до комп'ютера і передає зображення на екран.", 3000),
        text("/me починає проводити орофарінгоскопію.", 2000),
        screenshot(),
        text("/me згинає у відповідних місцях ендоскоп і вводить в середину горла пацієнта.", 3000),
        text("/do На екрані зображено збільшене в декілька разів зображення горла", 2000),
        text("/me оцінює стан пацієнта.", 3000),
        text("/try Аденоїди в нормі", 2000),
        screenshot(),
        text("/try Почервоніння виявлено", 3000),
        text("/try Патології виявлено", 2000),
        text("/me обережно витягує ендоскоп з горла пацієнта.", 3000),
        text("/me передає серветки і склянку з водою пацієнту.", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for otalaryngology otoscopy
;
OTOLARYNGOLOGY_OTOSCOPY := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/me підходить до пацієнта.", 2000),
        text("/do Отоскоп підключений до комп'ютера і транслює зображення на екран", 3000),
        text("/me починає отоскопію.", 2000),
        screenshot(),
        text("/me проводить отоскоп глибше в середину вуха.", 2000),
        text("/do На екрані транслюється збільшене в декілька разів зображення вуха зсередини", 2000),
        text("/me оцінює рухомість барабанної перетинки, її колір і загальний стан.", 3000),
        screenshot(),
        text("/try Рухомість барабанної перетинки в нормі", 2000),
        text("/try Колір барабанної перетинки в нормі", 3000),
        text("/try Загальний стан барабанної перетинки в нормі", 2000),
        text("/me витягує отоскоп з вуха пацієнта.", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology check variations
;
GYNECOLOGY_PREPARE_VARIATIONS := [
    [
        text("/me підійшов до раковини та ретельно вимив руки"),
        text("/do На столі стоять стерильні сухі серветки"),
        text("/me взяв серветку та витер руки"),
        text("/do На столі поряд з раковиною стоїть упаковка з новими рукавичками, та одноразовими масками для обличчя"),
        text("/me взяв рукавички в руки та одягнув їх"),
        text("/me взяв стерильну маску зі столу та одягнув її на обличчя"),
        text("/do Лікар використав антисептик щоб обробити руки в рукавичках"),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology check variations
;
GYNECOLOGY_PREPARE_VARIATIONS := [
    [
        text("/me підійшов до раковини та ретельно вимив руки"),
        text("/do На столі стоять стерильні сухі серветки", 2000),
        text("/me взяв серветку та витер руки", 3000),
        screenshot(),
        text("/do На столі поряд з раковиною стоїть упаковка з новими рукавичками, та одноразовими масками для обличчя", 2000),
        text("/me взяв рукавички в руки та одягнув їх", 3000),
        text("/me взяв стерильну маску зі столу та одягнув її на обличчя", 2000),
        text("/do Лікар використав антисептик щоб обробити руки в рукавичках", 3000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology take analysis variations
;
GYNECOLOGY_TAKE_ANALISYS_VARIATIONS := [
    [
        text("/do На столі лежить предметне скло з мазком"),
        text("/me бере підписане предметне скло з мазком.", 2000),
        text("/me кладе скло під мікроскоп.", 2000),
        screenshot(),
        text("/do Зразок вагінальних виділень лежить під мікроскопом", 2000),
        text("/me починає визначення наявності вагініту - запалення піхви.", 2000),
        text("/try Кількість плоских епітеліальних клітин в нормі", 2000),
        screenshot(),
        text("/try Кількість лейкоцитів в нормі", 2000),
        text("/try Наявність бактерій виявлено", 2000),
        text("/try Наявність грибків виявлено", 2000),
        text("/me заповнює бланк з результатами аналізу.", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology analysis variations
;
GYNECOLOGY_ANALISYS_VARIATIONS := [
    [
        text("/do На столику лежать інструменти для гінекологічного огляду, спеціальні дзеркала, шпатель для взяття мазків, гінекологічні щипці"),
        text("/me взяв гінекологічне дзеркало та змастив гелем", 2000),
        text("/me обережно ввів дзеркало у вагіну", 2000),
        text("/do Дзеркало розташоване правильно", 2000),
        screenshot(),
        text("/me взяв зі столика гінекологічний шпатель", 2000),
        text("/me обережно зібрав клітини з поверхні шийки матки та внутрішньої частини шийки", 2000),
        text("/me наніс зібраний матеріал на предметне скельце", 2000),
        text("/do Зразки дослідження зібрано", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology ultrasonic start analysis variations
;
GYNECOLOGY_ULTRASONIC_START_ANALISYS_VARIATIONS := [
    [
        text("/do Апарат УЗД увімкнено"),
        text("/me взяв банку з гелем в руку", 2000),
        text("/me видавив невелику кількість на низ живота пацієнтки", 2000),
        text("/me взяв датчик для проведення УЗД в праву руку", 2000),
        text("/me поклав датчик пацієнтці на живіт, та почала дослідження", 2000),
        text("/do Лікар водить датчиком по животу, детально вивчаючи зображення на апараті", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology ultrasonic analysis pregnancy variations
;
GYNECOLOGY_ULTRASONIC_ANALISYS_PREGNANCY_VARIATIONS := [
    [
        text("/try вагітність виявлено", 500, 200),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology ultrasonic analysis pathology variations
;
GYNECOLOGY_ULTRASONIC_ANALISYS_PATHOLOGY_VARIATIONS := [
    [
        text("/try патологію виявлено", 500, 200),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology ultrasonic finish analysis variations
;
GYNECOLOGY_ULTRASONIC_FINISH_ANALISYS_VARIATIONS := [
    [
        text("/do Серветки лежать поруч з апаратом УЗД"),
        text("/me взяв серветки та витерла датчик від залишків гелю", 2000),
        text("/me поставив датчик назад на апарат УЗД", 2000),
        text("/me передав серветки пацієнтці", 2000),
        text("/do Пацієнтка витерла гель із живота", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for 
;
EMPTY := [
    [
        text(""),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        text("", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for kedney donor surgery
;
KIDNEY_DONOR_VARIATIONS := [
    [
        text("/me перевіряє статус донора та підтверджує його готовність до операції."),
        text("/me почав підготовку до операції.", 2000),
        text("/do На столі заготовлені необхідні хірургічні інструменти", 3000),
        text("/me підключає пацієнта до апарату штучної вентиляції легень та моніторингу вітальних функцій.", 2000),
        text("/do Пацієнт погрузився в медикаментозний сон", 3000),
        screenshot(),
        text("/me роблить розріз по шкірі та відкривають доступ до нирки.", 2000),
        text("/do Стан нирки та задовільний", 3000),
        text("/me видаляє нирку з донора з урахуванням усіх необхідних безпечних процедур.", 2000),
        text("/me перекладає нирку в контейнер для транспортування.", 2000),
        screenshot(),
        text("/me проводить перевірку стану пацієнта.", 3000),
        text("/do Стан пацієнта задовільний.", 2000),        
        text("/me Закриває розріз та застосовує пов'язку.", 3000),
        text("/me відключає пацієнта від апарату штучної вентиляції легень.", 2000),
        text("/do Через деякий час пацієнт приходить до тями.", 3000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery preparation
;
SURGERY_PREPARATION_VARIATIONS := [
    [
        text("/me одягнув стерильний хірургічний халат"),
        text("/me обробив руки дезинфікуючим розчином", 2000),
        text("/do Руки хірурга чисті", 2000),
        text("/do Упаковка з одноразовими хірургічними рукавицями стоїть на столі", 2000),
        text("/me одягнув стерильні рукавиці та знову обробив руки антисептиком", 2000),
        text("/do Стерильна маска для обличчя лежить на столі", 2000),
        text("/me одягнув маску", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery start
;
SURGERY_START_VARIATIONS := [
    [
        text("/me включив лампи над хірургічним столом"),
        text("/me направив світло на пацієнта", 2000),
        text("/do Простерилізовані хірургічні інструменти лежать на столі", 2000),
        text("/do Пацієнт на операційному столі під наркозом та підготовлений до операції", 2000),
        text("/do Операція починається", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery appendix removal
;
SURGERY_APPENDIX_REMOVAL := [
    [
        text("/me обробляє операційне поле антисептиком"),
        text("/me намічає штрихом місце розрізу", 2000),
        text("/me взявши скальпель, підносить його до штриха і починає обережно розрізати шкіру, потім м'язові волокна", 2000),
        text("/me перевіряє орган апендиксу пінцетом на цілісність", 2000),
        text("/me обережно видаляє скальпелем орган апендиклса", 2000),
        screenshot(),
        text("/me кладе орган апендикса в спеціальну металеву тару", 2000),
        text("/do На столі лежить стерильна голка та хірургічні нитки", 2000),
        text("/me взяв голку із хірургічною ниткою зі столу", 2000),
        text("/me почав обережно зашивати розріз", 2000),
        screenshot(),
        text("/do Через деякий час розріз зашито", 2000),
        text("/me поставив голку назад на столик", 2000),
        text("/me взяв стерильну ватно- марлеву подушечку, та обережно приклав його до зашитого розрізу", 2000),
        text("/me лівою рукою тримаючи ватно-марлеву подушечку на рані, правою взяв хірургічний пластир та заклеїв рану", 2000),
        text("/do Рана зашита та оброблена", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery anasthesia
;
SURGERY_ANASTHESIA_VARIATIONS := [
    [
        text("/do Пацієнт розташований на операційному столі"),
        text("/me фіксує маску наркозно- дихального апарату на обличчі пацієнта", 2000),
        text("/me перевіряє чи добре зафіксована маска", 2000),
        text("/do На пацієнті маска, що під'єднана до наркозно- дихального апарату", 2000),
        text("/me увімкнув апарат", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for MRT processing
;
ANALYSIS_MRT_PRECESSING := [
    [
        text("/me увімкнув керування столом апарату МРТ"),
        text("/do Стіл з пацієнтом повільно заїжджає в тунель МРТ апарату", 2000),
        text("/me включив апарат Магнітно Резонансної Томографії", 2000),
        text("/do Процедура триває деякий час", 2000),
        text("/do Апарат працює та передає дані на стаціонарний комп'ютер лікаря", 2000),
        text("/do Дослідження закінчено", 2000),
        text("/me виключив апарат МРТ", 2000),
        text("/me натиснув кнопку управління", 2000),
        text("/do Пацієнт почав повільно виїжджати з тунелю", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for MRT results
;
ANALYSIS_MRT_RESULTS := [
    [
        text("/me взяв чисту флешку без інформації"),
        text("/me вставив флешку USB порт для передачі даних", 2000),
        text("/do Лікар почав переносити дані дослідження на флешку", 2000),
        text("/do Дія триває деякий час", 2000),
        screenshot(),
        text("/me паралельно почав ознайомлюватись та вивчати дані дослідження", 2000),
        text("/me детально переглянув результати МРТ дослідження", 2000),
        text("/try патологію виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for MRT print results
;
ANALYSIS_MRT_PRINT_RESULTS := [
    [
        text("/me завершив передачу даних на електронний носій"),
        text("/do Чистий бланк стоїть на столі", 2000),
        text("/me почав заповнювати бланк заключення дослідження", 2000),
        text("/me почав друк заключення МРТ дослідження", 2000),
        screenshot(),
        text("/do Принтер почав працювати", 2000),
        text("/do Через деякий час бланк роздруковано", 2000),
        text("/me витягнув флешку, та взяла готове заключення МРТ дослідження та передав пацієнту", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for narkologyst alko test
;
NARCOLOGYST_ALKO_TEST := [
    [
        text("/do Алкотестер `"Medicl+ Alco Control 7.0`" та набір в сумці на плечі"),
        text("/me дістав алкотестер з сумки та встанов одноразову трубочку.", 2000),
        text("/do Алкотестер включений та готовий до роботи", 2000),
        screenshot(),
        text("/me протягнув руку з тестером людині навпроти.", 2000),
        text("/do Незнайомець(ка) дмухає в алкотестер, алкотестер пищить", 2000),
        text("/try Алкотестер показав 0.0 проміле", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for narkologyst drugs test
;
NARCOLOGYST_DRUGS_TEST := [
    [
        text("/do Тест на наркотичні речовини в сумці"),
        text("/me дістав набір для перевірки на наркотичні речовини.", 2000),
        text("/me проколов середній палець незнайомцю навпроти та взяла кров на аналіз.", 2000),
        text("/try Тест на наркотики виконананий! Наркотики в крові виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for proctology meds
;
PROCTOLOGY_INSERT_MEDS := [
    [
        text("/do Сумочка проктолога у руці"),
        text("/me дістав з кейсу стерильні рукавички і надів їх на обидві руки", 2000),
        text("/me відкривши відсіки кейсу, дістав упаковку супозиторій білого кольору.", 2000),
        screenshot(),
        text("/me розкривши упаковку, взяв одну свічку в руку", 2000),
        text("/do Свічка в руці", 2000),
        text("/me обережно, швидко і легко ввів свічку в пряму кишку", 2000),
        text("/try свiчка встановлена", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for hemorrhoids healing
;
PROCTOLOGY_HEMORRHOIDS_HEALING := [
    [
        text("/me взявши маску від апарату для наркозу, надів її на пацієнта"),
        text("/do На правому плечі висить відкрита мед. сумка", 2000),
        text("/me діставши стерильні рукавички з мед. сумки, надів їх на руки", 2000),
        text("/me взявши операційну маску в руки, надів її на голову", 2000),
        text("/do Поруч із операційним столом стоїть стійка з інструментами", 2000),
        text("/me взяв затискач зі стійки", 2000),
        text("/me наклавши затискач на 1см від країв ануса, розтягнув його", 2000),
        text("/me оглянувши анальний отвір, стягнув затискач", 2000),
        screenshot(),
        text("/me прибирає затискач з країв ануса", 2000),
        text("/me починає видалення геморою", 2000),
        text("/me видаляє геморой", 2000),
        text("/do геморой видалений", 2000),
        text("/me дістав із мед. сумки мазь `"Цікадерма`"", 2000),
        screenshot(),
        text("/me обробивши свіжий опік маззю, стягнув затискачі", 2000),
        text("/me прибрав затискач з країв ануса", 2000),
        text("/me зняв стерильні рукавички з рук", 2000),
        text("/me зняв операційну маску з обличчя", 2000),
        text("/do Операція успішно завершена. Пацієнт повинен піти на реабілітацію", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for proctology enema
;
PROCTOLOGY_ENEMA := [
    [
        text("/do На плечі висить медична сумка"),
        text("/me відкрив медичну сумку, взяв з неї рукавички та надів їх на руки", 2000),
        text("/do Медичні латексні рукавички одягнені на руки", 2000),
        text("/do У шафці лежать медикаменти", 2000),
        screenshot(),
        text("/me відкрив шафку і дістав одноразову клізму", 2000),
        text("/do Клізма в руках", 2000),
        text("/me вiдкрив кран з водою", 2000),
        text("/me почав набирати воду в клiзму", 2000),
        text("/do Клiзма набрана", 2000),
        screenshot(),
        text("/me обережно спустив труси пацієнта", 2000),
        text("/me вставив шлангочку з клізми в анальний отвір", 2000),
        text("/do Шлангочка в отворі", 2000),
        text("/me почав потроху натискати на клізму випускаючи вміст у пряму кишку", 2000),
        text("/try фекальні виділення вийшли назовні", 2000),
        screenshot(),
        text("/me зняв рукавички і викинув їх у смiтник", 2000),
        text("/me відкрив медичну сумку, взяв з неї рукавички та надів їх на руки", 2000),
        text("/do Медичні латексні рукавички одягнені на руки", 2000),
    ]
]


; ====================================================================
; Array with text variations for proctology check
;
PROCTOLOGY_CHECK := [
    [
        text("/me дістав з кейсу стерильні рукавички і надів їх на обидві руки"),
        text("/me взявши операційну маску в руки, надів її на голову", 2000),
        text("/me розпакував стерильний анускоп", 2000),
        text("/me помічає нервовий вираз обличчя пацієнта", 2000),
        screenshot(),
        text("/me застосував змазку для забезпечення комфорту та зменшення болю.", 2000),
        text("/me проходить до огляду кишківника за допомогою анускопу.", 2000),
        text("/me Обережно вставляє анускоп в анус пацієнта та робить огляд кишківника.", 2000),
        text("/try патології виявлені", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for fluorography analysis
;
ANALYSIS_FLUOROGRAPHY := [
    [
        text("/me підготовлює апарат для флюорографії та перевіряє його на справність."),
        text("/do Апарат для проведення флюорограії справний", 2000),
        text("/me вказує пацієнту на необхідні заходи безпеки та комфорту під час процедури.", 2000),
        text("/me надає інструкції пацієнту щодо утримання дихання та позиціонування тіла.", 2000),
        screenshot(),
        text("/me починає зйомку зображень.", 2000),
        text("/do Апарат для проведення флюорограії проводить зйомку", 2000),
        text("/me переконується, що всі необхідні анатомічні деталі на них відображені чітко.", 2000),
        screenshot(),
        text("/do зображеня флюорографії виведено на екран", 2000),
        text("/me проводить аналіз результатів.", 2000),
        text("/try патології виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for xray analysis
;
ANALYSIS_X_RAY := [
    [
        text("/me підготовлює апарат для рентгенографії та перевіряє його на справність."),
        text("/do Апарат для проведення рентгенографії справний", 2000),
        text("/me вказує пацієнту на необхідні заходи безпеки та комфорту під час процедури.", 2000),
        text("/me надає інструкції пацієнту щодо утримання дихання та позиціонування тіла.", 2000),
        screenshot(),
        text("/me починає зйомку зображень.", 2000),
        text("/do Апарат для проведення рентгенографії проводить зйомку", 2000),
        text("/me переконується, що всі необхідні анатомічні деталі на них відображені чітко.", 2000),
        screenshot(),
        text("/do рентгенівський знімок виведено на екран", 2000),
        text("/me проводить аналіз результатів.", 2000),
        text("/try патології виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for DNA analysis
;
ANALYSIS_DNA := [
    [
        text("/me підготовлює необхідні матеріали та реагенти для проведення ДНК тестування та аналізу."),
        text("/me збирає зразки ДНК від пацієнта за допомогою ватного тампона.", 2000),
        text("/me вкладає зібрані зразки до апарату для проведення аналізу.", 2000),
        text("/do процес аналізу ДНК в процесі.", 2000),
        text("/me аналізує отримані результати та декодує генетичні характеристики пацієнта.", 2000),
        screenshot(),
    ]
]



; ====================================================================
; Creates a map with defined text, delay_before and delay_after
;
text(text, delay_before := 0, delay_after := 0) {
    return Map(
        "type", "text",
        "text", text,
        "delay_before", delay_before,
        "delay_after", delay_after
    )
}


; ====================================================================
; Creates a map with delay type
;
delay(timeMs) {
    return Map(
        "type", "delay",
        "delay_before", timeMs
    )
}


; ====================================================================
; Creates a map with screenshot type
;
screenshot(delay_before := 0, delay_after := 0) {
    return Map(
        "type", "screenshot",
        "delay_before", delay_before,
        "delay_after", delay_after
    )
}
