#Requires AutoHotkey v2.0

DOCTOR_RANK := "7"
DOCTOR_NAME := "Alex Aspero"
STATIC_ID := "46746"

DOCTORS_BADGE := "[EMS | " DOCTOR_RANK " | " DOCTOR_NAME " | № " STATIC_ID "]"


; ====================================================================
; Array with text variations for showing a doctor's badge
;
BADGE_VARIATIONS := [
    [
        text("/do На грудях закріплений бейджик " DOCTORS_BADGE)
    ]
]


; ====================================================================
; Array with text variations for selling tablets blister
;
DRUGS_BLISTER_VARIATIONS := [
    [
        text("/me з сумкою медикаментів на плечі дістає блістер і передає людині навпроти")
    ],
    [
        text("/me витягує з сумки на плечі аптечку і відкриває її, дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку седативного, дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Парацетамол`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Ношпа`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Нурофен`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Ібупрофен`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі упаковку `"Веселі вітамінки`", дістає блістер з пігулками і передає пацієнту")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"A`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"B6`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"B12`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"C`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"D`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"E`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з вітамінами `"Мультітабс`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з капсулами `"OMEGA-3`" і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку, відкриває її, дістає блістер з аскорбінкою і передає її людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з рожевими пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер із синіми пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з жовтими пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з зеленими пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з червоними пігулками і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер жувальними вітамінами і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами із фруктовим смаком і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами з яблучним смаком і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами з апельсиновим смаком і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами із полуничним смаком і передає людині навпроти")
    ],
    [
        text("/me з сумкою медикаментів на плечі дістає блістер з вітамінами з банановим смаком і передає людині навпроти")
    ]
]


; ====================================================================
; Array with text variations for selling/healing with vitamins
;
DRUGS_VITAMIN_VARIATIONS := [
    [
        text("/me з сумкою медикаментів на плечі дістає контейнер з вітамінами, витягує вітамінку передає і людині навпроти")
    ],
    [
        text("/me дістає з кишені маленьку червону вітамінку і передає її людині навпроти")
    ],
    [
        text("/me дістає з кишені маленьку синю вітамінку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін А`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін С`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін D`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін E`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін B6`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені блістер з надписом `"Вітамін B12`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me виймає з кишені упаковку з надписом `"Мультітабс`", дістає одну пігулку і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки аптечку і відкриває її, дістає капсулу з вітамінами і передає її людині навпроти"),
        text("/do капсула має зелений колір і ледь помітно світиться у темряві", 200)
    ],
    [
        text("/me витягує з сумки аптечку і відкриває її, дістає капсулу з вітамінами і передає її людині навпроти"),
        text("/do капсула має жовтий колір і, здається, трохи вібрує", 200)
    ],
    [
        text("/me витягує з сумки аптечку і відкриває її, дістає капсулу з вітамінами і передає її людині навпроти"),
        text("/do капсула дуже липка і має червоний колір", 200)
    ],
    [
        text("/me відкриває маленький контейнер `"Весела Вітамінка`" і, посміхаючись, передає пігулку пацієнту")
    ],
    [
        text("/me відкриває маленький контейнер `"Смачна Порція Здоров'я`" і передає пігулку пацієнту")
    ],
    [
        text("/me відкриває маленький контейнер `"Радісний Вітамінчик`" і передає пігулку пацієнту")
    ],
    [
        text("/me відкриває маленький контейнер `"Вітаміни Для Всієї Родини`" і передає пігулку пацієнту")
    ],
    [
        text("/me витягує з сумки на плечі аптечку і відкриває її, дістає капсулу з вітамінами і передає її людині навпроти")
    ],
    [
        text("/me витягує з сумки на плечі інжектор з вітамінами, обирає правильну дозу, і вколює людині навпроти")
    ],
    [
        text("/me витягує з сумки на плечі гематоген та передає людині навпроти")
    ],
    [
        text("/me витягує з сумки на плечі аптечку і відкриває її, дістає пігулку аскорбінки і передає пацієнту")
    ],
]


; ====================================================================
; Array with text variations blood donation from patient
;
BLOOD_DONATION_VARIATIONS := [
    [
        text("/do Дістаю обладнання для забирання крові",, 300),
        text("/do Перевіряю наявність всього необхідного для забирання крові (інструменти, рукавички, дезінфікуючі засоби)",, 300),
        text("/me просунув голку у вену донора та забирав необхідну кількість крові", 150, 300),
        text("/me зняв голку та наклав стерильний бинт на місце уколу", 300, 300),
        text("/do Прикладаю ватку зі спиртом на місце уколу та тримаю його декілька хвилин, щоб зупинити кровотік",,1000),
        text("/me завершив забирання крові у пацієнта")
    ],
    [
        text("/me дістає обладнання для забирання крові"),
        text("/me перевіяє наявність всього необхідного для забирання крові", 300),
        text("/me зробив прокол вени за допомогоє голки і почав збирати кров", 300),
        text("/me дістав голку та наклав стерильний бинт на місце проколу", 3000),
        text("/me прикладає ватку зі спиртом на місце проколу та тримаю його декілька хвилин, щоб зупинити кровотік", 300),
        text("/me завершив забирання крові у пацієнта", 400),
    ],
    [
        text("/me дістає обладнання для забирання крові"),
        text("/me надягає стерильні рукавички", 400),
        text("/me ретельно вивчає доступні вени та обирає найліпшу для процедури і робить прокол", 400),
        text("/do Кров починає перетікати у гемокон", 300),
        text("/do Гемокон виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає стерильний бинт до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me вимірює тиск пацієнта та перевіряє його пульс для оцінки загального стану здоров'я"),
        text("/do Пацієнт вигляє цілком здоровим", 500),
        text("/me дістає обладнання для забирання крові", 1000),
        text("/me дезінфікує місце проколу для запобігання інфекціям.", 1000),
        text("/me використовує голку для проколу вени на лівій руці, фіксує її та підключає до системи збору крові", 300),
        text("/do Кров починає перетікати у гемокон", 500),
        text("/do Гемокон виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає змочену спиртом ватку до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me вимірює тиск пацієнта та перевіряє його пульс для оцінки загального стану здоров'я"),
        text("/do Пацієнт вигляє цілком здоровим", 500),
        text("/me дістає обладнання для забирання крові", 1000),
        text("/me дезінфікує місце проколу для запобігання інфекціям.", 1000),
        text("/me використовує голку для проколу вени на лівій руці, фіксує її та підключає до системи збору крові", 300),
        text("/do Кров починає перетікати у гемокон", 500),
        text("/do Гемокон виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає змочену спиртом ватку до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me вимірює тиск пацієнта та перевіряє його пульс для оцінки загального стану здоров'я"),
        text("/do Пацієнт вигляє цілком здоровим", 500),
        text("/me дістає обладнання для забирання крові", 1000),
        text("/me використовує голку для проколу вени на правій руці, фіксує її та підключає до системи збору крові", 1000),
        text("/do Кров починає перетікати у герметичний контейнер", 450),
        text("/do Контейнер виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає змочену спиртом ватку до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me вимірює тиск пацієнта та перевіряє його пульс для оцінки загального стану здоров'я"),
        text("/do Пацієнт вигляє цілком здоровим", 500),
        text("/me дістає обладнання для забирання крові", 1000),
        text("/me використовує голку для проколу вени на правій руці, фіксує її та підключає до системи збору крові", 1000),
        text("/do Голка зіскакує і краплі крові розлітаються по салону авто", 1000),
        text("/me швидко поправляє голку і витирає зі свого обличчя кров пацієнта", 1000),
        text("/do Кров починає перетікати у герметичний контейнер", 300),
        text("/do Гемокон виглядає наповненим", 3000),
        text("/me від'єднує голку та прикладає змочену спиртом ватку до місця проколу", 400),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
    [
        text("/me дістає обладнання для забирання крові"),
        text("/me перевіряє наявність всього необхідного для забирання крові", 500),
        text("/me зробив голкою прокол вени і почав збір крові", 500),
        text("/do Обличчя пацієнта раптово стає блідим і він втрачає свідомість", 1000),
        text("/me дістав нашатирний спирт і провів кілька разів під носом у пацієнта", 600),
        text("/do Пацієнт опритомнів", 2000),
        text("/me від'єднує голку та прикладає стерильний бинт до місця проколу", 500),
        text("/me завершив забирання крові у пацієнта", 300),
    ],
]


; ====================================================================
; Array with text variations for person reanimation
;
REANIMATION_VARIATIONS := [
    [
        text("/me оцінює наявність пульсу у постраждалого"),
        text("/do Пульс відсутній, терміново потрібно розпочати реанімаційні заходи", 500),
        text("/me дістає з сумки на плечі дефибрилятор і підготовлює його до використання", 500),
        text("/do Дефибрилятор зарядженний", 600),
        text("/me робить розряд дефибрилятора на грудях постраждалого", 600),
        text("/do Постраждалий поступово подає ознаки життя і приходить до тями", 800),
    ],
    [
        text("/me перевіряє наявність ознак життя та визначає наявність дихання у постраждалого"),
        text("/do Oзнаки дихання відсутні", 1000),
        text("/me розпочинає тиснути на грудну клітину відповідно до протоколу реанімації", 800),
        text("/do Постраждалий повертається до свідомості", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя та визначає наявність дихання у постраждалого"),
        text("/do Oзнаки дихання відсутні", 700),
        text("/me починає виконувати непрямий масаж серця", 500),
        text("/do Серцевий ритм відновлюється, пацієнт може самостійно дихати", 800),
        text("/do Постраждалий повертається до свідомості", 1000),
    ],
    [
        text("/me оцінює наявність пульсу у постраждалого"),
        text("/do Пульс відсутній, можлива зупинка серця", 700),
        text("/me дістає з сумки на плечі шприц із адреналіном і робить інʼєкцію в серце", 500),
        text("/me починає непрямий масаж серця", 800),
        text("/do Серцевий ритм відновлються, пацієнт приходить до свідомості", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя у постраждалого"),
        text("/do Пульс та дихання присутні", 1000),
        text("/me дістає з сумки на плечі тампон із нашатирим спиртом", 600),
        text("/me кілька разів проводить тампоном під носом у постраждалого", 800),
        text("/do Постраждалий опритомнює", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя та визначає наявність дихання у постраждалого"),
        text("/do Oзнаки дихання відсутні", 700),
        text("/me дістає із сумки на плечі вентиляційний балон", 500),
        text("/me починає проводити штучну вентиляцію легень", 800),
        text("/do Дихання відновлюється, пацієнт опритомнює", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя у постраждалого"),
        text("/do Пульс та дихання присутні, на постраждалому присутні сліди забиття", 700),
        text("/me дістає з сумки на шприц із морфієм", 500),
        text("/me робить інʼєкцію у вену на руці постраждалого", 800),
        text("/do Постраждалий повертається до свідомісті", 1000),
    ],
    [
        text("/me оцінює стан постраждалого"),
        text("/do Пульс відсутній, можлива зупинка серця", 700),
        text("/me дістає з сумки на плечі дефибрилятор і прикріплює електроди на грудях постраждалого", 500),
        text("/do Дефибрилятор заряджений", 800),
        text("/me робить розряд дефибрилятора", 500),
        text("/do Життєві функції відновлені, пацієнт приходить до тями", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя у постраждалого"),
        text("/do Пульс та дихання присутні, на постраждалому присутні ознаки забиття", 700),
        text("/me дістає з сумки на шприц із норадреналіном", 500),
        text("/me робить інʼєкцію у вену на руці постраждалого", 800),
        text("/do Постраждалий повертається до свідомісті", 1000),
    ],
    [
        text("/me перевіряє наявність ознак життя у постраждалого"),
        text("/do Пульс та дихання присутні, на постраждалому присутні ознаки забиття", 700),
        text("/me дістає з сумки на шприц із анальгіном", 500),
        text("/me робить інʼєкцію у вену на руці постраждалого", 800),
        text("/do Постраждалий поступово повертається до свідомісті", 1000),
    ],
]


; ====================================================================
; Array with text variations for med card body temperature check
;
MED_CARD_TEMPERATURE_CHECK_VARIATIONS := [
    [
        text("/do На столі лежить пірометр"),
        text("/me протягнув руку до столу та взяв пірометр", 500),
        text("/do Пірометр в руках", 500),
        text("/me направив пірометр на чоло", 1000),
        text("/do Пірометр показав - 36.6", 1000),
        text("/me поклав пірометр на стіл", 500),
    ]
]


; ====================================================================
; Array with text variations for med card throat check
;
MED_CARD_THROAT_CHECK_VARIATIONS := [
    [
        text("/do Дерев'яний шпатель лежить на столі"),
        text("/me взяв зі стола одноразовий шпатель", 500),
        text("/me обережно поклав шпатель в ротову порожнину та почав огляд", 500),
        text("/do Патології відсутні", 1000),
        text("/me дістав шпатель та викинув у смітник",1000),
    ]
]


; ====================================================================
; Array with text variations for med lungs check
;
MED_CARD_LUNGS_CHECK_VARIATIONS := [
    [
        text("/do Стетоскоп висить на шиї"),
        text("/me зняв стетоскоп та почав вислуховування", 500),
        text("/do Патологій не виявлено, легені чисті", 1000),
        text("/me повісив стетоскоп на шию", 1000),
    ]
]


; ====================================================================
; Array with text variations for med signing
;
MED_CARD_SIGN_VARIATIONS := [
    [
        text("/do Чистий бланк медичної карти лежить на столі"),
        text("/me взяв чистий бланк та почав вносити інформацію", 500),
        text("/do Бланк медичної картки заповнено", 1000),
        text("/me передав заповнений бланк пацієнту", 1000),
    ]
]


; ====================================================================
; Array with text variations while can't find a body
;
CANT_FIND_A_BODY_VARIATIONS := [
    [
        text("/me вічуває наявність аномалій на місці подій"),
        text("/do Постраждалий наче розчинився у повітрі", 500),
        text("/b Не можу вас побачити, і почути - напишіть в чат /b де саме вас шукати", 1000),
        text("/b Я побачу вас тільки коли торкнуся я або хтось інший", 500),
    ]
]


; ====================================================================
; Array with text variations for blood analysis
;
ANALYSIS_BLOOD_VARIATIONS := [
    [
        text("/me почав підготовку для проведення аналізу крові"),
        text("/do На столі лежать стерильна голка та пробірка", 500),
        text("/me взяв руку пацієнта, обробив палець спиртом", 1000),
        screenshot(),
        text("/me зробив прокол на мальці і почав збір крові у пробірку", 1000),
        text("/do Пробірка повністню заповнена", 1000),
        text("/me вставив пробірку із кровʼю в апарат і запустив тест", 1000),
        screenshot(),
        text("/do Прилад завершив обробку і почав друк результатів", 1000),
    ]
]


; ====================================================================
; Array with text variations for plastic surgery
;
PLASCTIC_SURGERY_VARIATIONS := [
    [
        text("/me почав підготовку для проведення аналізу крові"),
        text("/do На столі лежать стерильна голка та пробірка", 500),
        text("/me взяв руку пацієнта, обробив палець спиртом", 1000),
        screenshot(),
        text("/me зробив прокол на мальці і почав збір крові у пробірку", 1000),
        text("/do Пробірка повністню заповнена", 1000),
        text("/me вставив пробірку із кровʼю в апарат і запустив тест", 1000),
        screenshot(),
        text("/do прилад завершив обробку і почав друк результатів", 1000),
    ]
]


; ====================================================================
; Array with text variations for oculist right eye check
;
OCULIST_RIGHT_EYE_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/do На столі лежать необхідні для перевірки інструменти", 1000),
        text("/me бере зі столу невелику баночку з мідріатичними краплями, що розширюють зіницю.", 1000),
        text("/me крапає до правого ока пацієнта 3 краплі.", 1000),
        text("/do Зіниця правого ока пацієнта розширена.", 1000),
        screenshot(),
        text("/me у правій руці тримає офтальмоскоп, поступово приближуючі його до правого ока пацієнта.", 3000),
        text("/do Промінь світла прямує прямо в зіницю", 2000),
        text("/do Прилад збільшує картинку в 16 разів", 1500),
        screenshot(),
        text("/me уважно розглядає сітківку ока пацієнта.", 1000),
        text("/try Ретинит (запалення сітківки) виявлено", 1500),
        text("/try Периферична дистрофія сітківки виявлена", 1500),
        text("/try Диск зорового нерва має блідо-рожевий відтінок з чіткими та рівними межами", 1000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for oculist left eye check
;
OCULIST_LEFT_EYE_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/do На столі лежать необхідні для перевірки інструменти", 1000),
        text("/me бере зі столу невелику баночку з мідріатичними краплями, що розширюють зіницю.", 1000),
        text("/me крапає до лівого ока пацієнта 3 краплі.", 3000),
        text("/do Зіниця лівого ока пацієнта розширена.", 2000),
        screenshot(),
        text("/me у правій руці тримає офтальмоскоп, поступово приближуючі його до лівого ока пацієнта.", 3000),
        text("/do Промінь світла прямує прямо в зіницю", 1000),
        text("/do Прилад збільшує картинку в 16 разів", 3000),
        screenshot(),
        text("/me уважно розглядає сітківку ока пацієнта.", 2000),
        text("/try Ретинит (запалення сітківки) виявлено", 3000),
        text("/try Периферична дистрофія сітківки виявлена", 1500),
        text("/try Диск зорового нерва має блідо-рожевий відтінок з чіткими та рівними межами", 1500),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology check
;
STOMATOLOGY_TOOTH_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 2000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для огляду ротової порожнини", 2000),
        text("/me тримає в руках шпатель і дзеркало.", 2000),
        text("/me оглядає загальний стан щелепи пацієнта при зімкнутих зубах.", 2000),
        text("/me піднімає стоматологічним дзеркалом розслаблену нижню і верхню губу.", 2000),
        text("/me злегка відтягуює щоку пацієнта, обстежучи переддень рота.", 2000),
        text("/try Червоні облямівки виявлено", 3000),
        text("/try Проблеми в куточках роту виявлено", 2000),
        text("/try Набряки та припухлість виявлено", 2000),
        screenshot(),
        text("/me переходить до ретельного огляду кожного зуба.", 2000),
        text("/me обережно поветртає голову пацієнта в зручніше положення для огляду.", 3000),
        text("/me легенько піднімаючи верхню губу за допомогою шпателя, оглядає фронтову частину верхнього ряду зубів.", 1500),
        text("/me бере із лотку з інструментами гострий зонд для перевірки якості емалі.", 3000),
        text("/me тримає в руках гострий зонд.", 3000),
        text("/me легенько проводить гострим кінчиком зонду по емалі кожнго зуба.", 3000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок верхнього ряду зубів.", 3000),
        text("/try Каріозні прояви виявлено", 3000),
        screenshot(),
        text("/do Стан зубів верхнього ряду у пацієнта задовільний", 3000),
        text("/me продовжує огляд.", 3000),
        text("/me легенько піднімаючи нижню губу за допомогою шпателя, оглядає фронтову частину нижнього ряду зубів.", 3000),
        text("/me обережно проводить гострим кінчиком зонду по емалі кожнго зуба.", 3000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок нижнього ряду зубів.", 3000),
        text("/try Каріозні прояви виявлено", 3000),
        text("/do Стан зубів нижнього ряду у пацієнта задовільний", 3000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology brackets check
;
STOMATOLOGY_BRACKETS_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 2000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для огляду ротової порожнини", 3000),
        screenshot(),
        text("/me тримає в руках шпатель і дзеркало.", 2000),
        text("/me оглядає загальний стан щелепи пацієнта при зімкнутих зубах.", 2000),
        text("/me піднімає стоматологічним дзеркалом розслаблену нижню і верхню губу.", 3000),
        text("/me злегка відтягуює щоку пацієнта, обстежучи переддень рота.", 2000),
        text("/me переходить до ретельного огляду кожного зуба.", 2000),
        text("/me обережно поветртає голову пацієнта в зручніше положення для огляду.", 3000),
        text("/me легенько піднімаючи верхню губу за допомогою шпателя, оглядає фронтову частину верхнього ряду зубів.", 2000),
        text("/me бере із лотку з інструментами гострий зонд для перевірки якості емалі.", 2000),
        text("/me тримає в руках гострий зонд.", 3000),
        screenshot(),
        text("/me легенько проводить гострим кінчиком зонду по емалі кожнго зуба.", 2000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок верхнього ряду зубів.", 2000),
        text("/do Каріозні прояви не виявлено", 3000),
        text("/do Стан зубів верхнього ряду у пацієнта задовільний", 2000),
        text("/me продовжує огляд.", 2000),
        text("/me легенько піднімаючи нижню губу за допомогою шпателя, оглядає фронтову частину нижнього ряду зубів.", 3000),
        text("/me обережно проводить гострим кінчиком зонду по емалі кожнго зуба.", 2000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок нижнього ряду зубів.", 3000),
        text("/do Каріозні прояви не виявлено", 3000),
        text("/do Стан зубів нижнього ряду у пацієнта задовільний", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology tooth cleaning
;
STOMATOLOGY_TOOTH_CLEANING_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 3000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/me проводить огляд для оцінки та стану зубів і ясен, щоб зрозуміти масштаб роботи та визначити необхідні методи.", 3000),
        text("/do Шприц з розчином анестезії лежить на столі", 2000),
        text("/me дістає з шухляди одноразові голки.", 2000),
        text("/me вставляє голку в шприц з розчином анестезії.", 3000),
        screenshot(),
        text("/me обережно піднімаючи верхню губу стоматологічним дзеркалом, вводить голку в верхнє ясно над шостим зубом зліва.", 2000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/me піднімає дзеркалом верхню губу пацієнта з правої сторони.", 2000),
        text("/me обережно вводить голку в ясно над шостим верхнім зубом.", 3000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/me повторює процедуру на нижній щелепі пацієнта.", 2000),
        text("/do Анестезія введна успішно.", 3000),
        text("/do Слиновідсмоктувач підключений до бор-машини.", 2000),
        text("/me згинає трубку слиновідсмоктувача в  зручне положення.", 2000),
        text("/me встановлює трубку слиновідсмоктувача у рот пацієнта.", 3000),
        text("/me готується до механічної чистки ультразвуком.", 2000),
        text("/me одягає пластикові захисні окуляри.", 2000),
        screenshot(),
        text("/do В бор-машину підключений ультразвуковий скалер із металевою насадкою", 3000),
        text("/me за допомогою апарату починає дію безпосередньо на поверхню емалі.", 2000),
        text("/me починає очищення ясенних кишень.", 2000),
        text("/do Затверділі відкладення дробляться на дрібні фрагменти, які виводяться через слиновідсмоктувач", 3000),
        text("/me прибирає в сторону ультразвуковий скалер із металевою насадкою.", 2000),
        text("/me підготовлює інструменти для видаленням м'ягкого нальоту методом Air Flow.", 2000),
        text("/me готує суміш, що складається з води та круглих гранул кальцію і м’якого порошку гліцину.", 3000),
        text("/me за допомогою спеціального апарату на поверхню зубів потужним струменем розпорошує суміш.", 2000),
        text("/me підбирає рівень абразивності пилки.", 2000),
        text("/me знімає суміш з зубів за допомогою спеціальновизначених насадок.", 3000),
        text("/me поліруює емаль кожного зуба спеціальною пастою, яка також профілактує утворення нальоту.", 2000),
        text("/me наносить спеціальний гель зі фтором для зміцнення зубів.", 2000),
        text("/do Професійна чистка завершена успішно", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology tooth removal
;
STOMATOLOGY_TOOTH_REMOVAL_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 3000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/me проводить огляд для оцінки та стану зуба, щоб зрозуміти масштаб роботи.", 3000),
        text("/do Слиновідсмоктувач підключений до бор-машини.", 2000),
        text("/me згинає трубку слиновідсмоктувача в  зручне положення.", 2000),
        text("/me встановлює трубку слиновідсмоктувача у рот пацієнта.", 3000),
        screenshot(),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для операції", 2000),
        text("/me тримає в руках щипці та тампонаду.", 2000),
        text("/me встановлює тампонаду між щокою та яснами пацієнта.", 3000),
        text("/do Шприц з розчином анестезії лежить на столі.", 2000),
        text("/me дістає з шухляди одноразові голки.", 2000),
        text("/me вставляє голку в шприц з розчином анестезії.", 3000),
        text("/me обережно піднімаючи губу стоматологічним дзеркалом, вводить голку в ясно над зубом.", 2000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/do Анестезія введна успішно.", 3000),
        screenshot(),
        text("/me перевіряє чутливість навколо зуба гострим зондом.", 2000),
        text("/me від'єднує кругову зв'язку кореня за допомогою спеціальних інструментів.", 2000),
        text("/me накладає щічки щипців на зуб.", 3000),
        text("/me просуває щічки щипців до емалевоцементної границі.", 2000),
        text("/me змикає ручки щипців всіма п'ятьма пальцями руки.", 3000),
        text("/me починає вихитувати зуб для видалення із лунки.", 2000),
        text("/do Зуб видалено", 4000),
        text("/me здавлює краї вивільненої лунки.", 3000),
        text("/me вкладає ватний тампон, який затискає всередині.", 2000),
        text("/me починає кюретаж лунки і ушивання.", 3000),
        text("/me завершує процедури, які забезпечать чистоту лунки зуба після видалення і швидке загоєння.", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for tooth X-RAY
;
STOMATOLOGY_TOOTH_X_RAY := [
    [
        text("/do Прилад для рентгенової панорами стоїть біля бор-машини"),
        text("/me піднімає спинку крісла на 90°.", 2000),
        text("/me встановлює над пацієнтом ортопантомограф.", 3000),
        text("/me встановлює необхідні параметри програми.", 2000),
        text("/me запускає рентген-апарат.", 3000),
        text("/do Рентгенівська трубка обертається і взаємодіє з датчиком", 2000),
        text("/do Трубка зчитує необхідну інформацію і після обробки спеціальною програмою виводить готове зображення на екран", 3000),
    ]
]


; ====================================================================
; Creates a map with defined text, delay_before and delay_after
;
text(text, delay_before := 0, delay_after := 0) {
    return Map(
        "type", "text",
        "text", text,
        "delay_before", delay_before,
        "delay_after", delay_after
    )
}


; ====================================================================
; Creates a map with delay type
;
delay(timeMs) {
    return Map(
        "type", "delay",
        "delay_before", timeMs
    )
}


; ====================================================================
; Creates a map with screenshot type
;
screenshot(delay_before := 0, delay_after := 0) {
    return Map(
        "type", "screenshot",
        "delay_before", delay_before,
        "delay_after", delay_after
    )
}
