; ====================================================================
; Array with text variations for MRT processing
;
ANALYSIS_MRT_PRECESSING := [
    [
        text("/me увімкну{в|ла} керування столом апарату МРТ"),
        text("/do Стіл з пацієнтом повільно заїжджає в тунель МРТ апарату", 2000),
        text("/me включи{в|ла} апарат Магнітно Резонансної Томографії", 2000),
        text("/do Процедура триває деякий час", 2000),
        text("/do Апарат працює та передає дані на стаціонарний комп'ютер лікаря", 2000),
        text("/do Дослідження закінчено", 2000),
        text("/me виключи{в|ла} апарат МРТ", 2000),
        text("/me натисну{в|ла} кнопку управління", 2000),
        text("/do Пацієнт почав повільно виїжджати з тунелю", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for MRT results
;
ANALYSIS_MRT_RESULTS := [
    [
        text("/me взя{в|ла} чисту флешку без інформації"),
        text("/me встави{в|ла} флешку USB порт для передачі даних", 2000),
        text("/do Лікар поча{в|ла} переносити дані дослідження на флешку", 2000),
        text("/do Дія триває деякий час", 2000),
        screenshot(),
        text("/me паралельно поча{в|ла} ознайомлюватись та вивчати дані дослідження", 2000),
        text("/me детально переглянув результати МРТ дослідження", 2000),
        text("/try патологію виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for MRT print results
;
ANALYSIS_MRT_PRINT_RESULTS := [
    [
        text("/me заверши{в|ла} передачу даних на електронний носій"),
        text("/do Чистий бланк стоїть на столі", 2000),
        text("/me поча{в|ла} заповнювати бланк заключення дослідження", 2000),
        text("/me поча{в|ла} друк заключення МРТ дослідження", 2000),
        screenshot(),
        text("/do Принтер почав працювати", 2000),
        text("/do Через деякий час бланк роздруковано", 2000),
        text("/me витягну{в|ла} флешку, та взя{в|ла} готове заключення МРТ дослідження та переда{в|ла} пацієнту", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for narkologyst alko test
;
NARCOLOGYST_ALKO_TEST := [
    [
        text("/do Алкотестер `"Medicl+ Alco Control 7.0`" та набір в сумці на плечі"),
        text("/me діста{в|ла} алкотестер з сумки та встанови{в|ла} одноразову трубочку.", 2000),
        text("/do Алкотестер включений та готовий до роботи", 2000),
        screenshot(),
        text("/me протягну{в|ла} руку з тестером людині навпроти.", 2000),
        text("/do Незнайомець(ка) дмухає в алкотестер, алкотестер пищить", 2000),
        text("/try Алкотестер показав 0.0 проміле", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for narkologyst drugs test
;
NARCOLOGYST_DRUGS_TEST := [
    [
        text("/do Тест на наркотичні речовини в сумці"),
        text("/me діста{в|ла} набір для перевірки на наркотичні речовини.", 2000),
        text("/me проколо{в|ла} середній палець незнайомцю навпроти та взя{в|ла} кров на аналіз.", 2000),
        text("/try Тест на наркотики виконананий! Наркотики в крові виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for proctology meds
;
PROCTOLOGY_INSERT_MEDS := [
    [
        text("/do Сумочка проктолога у руці"),
        text("/me діста{в|ла} з кейсу стерильні рукавички і наді{в|ла} їх на обидві руки", 2000),
        text("/me відкривши відсіки кейсу, діста{в|ла} упаковку супозиторій білого кольору.", 2000),
        screenshot(),
        text("/me розкривши упаковку, взя{в|ла} одну свічку в руку", 2000),
        text("/do Свічка в руці", 2000),
        text("/me обережно, швидко і легко вв{ів|ела} свічку в пряму кишку", 2000),
        text("/try свiчка встановлена", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for hemorrhoids healing
;
PROCTOLOGY_HEMORRHOIDS_HEALING := [
    [
        text("/me взявши маску від апарату для наркозу, наді{в|ла} її на пацієнта"),
        text("/do На правому плечі висить відкрита мед. сумка", 2000),
        text("/me діставши стерильні рукавички з мед. сумки, наді{в|ла} їх на руки", 2000),
        text("/me взявши операційну маску в руки, наді{в|ла} її на голову", 2000),
        text("/do Поруч із операційним столом стоїть стійка з інструментами", 2000),
        text("/me взя{в|ла} затискач зі стійки", 2000),
        text("/me наклавши затискач на 1см від країв ануса, розтягну{в|ла} його", 2000),
        text("/me оглянувши анальний отвір, стягну{в|ла} затискач", 2000),
        screenshot(),
        text("/me прибирає затискач з країв ануса", 2000),
        text("/me починає видалення геморою", 2000),
        text("/me видаляє геморой", 2000),
        text("/do геморой видалений", 2000),
        text("/me діста{в|ла} із мед. сумки мазь `"Цікадерма`"", 2000),
        screenshot(),
        text("/me обробивши свіжий опік маззю, стягнув затискачі", 2000),
        text("/me прибра{в|ла} затискач з країв ануса", 2000),
        text("/me зня{в|ла} стерильні рукавички з рук", 2000),
        text("/me зня{в|ла} операційну маску з обличчя", 2000),
        text("/do Операція успішно завершена. Пацієнт повинен піти на реабілітацію", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for proctology enema
;
PROCTOLOGY_ENEMA := [
    [
        text("/do На плечі висить медична сумка"),
        text("/me відкри{в|ла} медичну сумку, взя{в|ла} з неї рукавички та наді{в|ла} їх на руки", 2000),
        text("/do Медичні латексні рукавички одягнені на руки", 2000),
        text("/do У шафці лежать медикаменти", 2000),
        screenshot(),
        text("/me відкри{в|ла} шафку і діста{в|ла} одноразову клізму", 2000),
        text("/do Клізма в руках", 2000),
        text("/me вiдкри{в|ла} кран з водою", 2000),
        text("/me поча{в|ла} набирати воду в клiзму", 2000),
        text("/do Клiзма набрана", 2000),
        screenshot(),
        text("/me обережно спусти{в|ла} труси пацієнта", 2000),
        text("/me встави{в|ла} шлангочку з клізми в анальний отвір", 2000),
        text("/do Шлангочка в отворі", 2000),
        text("/me поча{в|ла} потроху натискати на клізму випускаючи вміст у пряму кишку", 2000),
        text("/try фекальні виділення вийшли назовні", 2000),
        screenshot(),
        text("/me зн{в|ла}в рукавички і викинув їх у смiтник", 2000),
        text("/me відкри{в|ла} медичну сумку, взя{в|ла} з неї рукавички та наді{в|ла} їх на руки", 2000),
        text("/do Медичні латексні рукавички одягнені на руки", 2000),
    ]
]


; ====================================================================
; Array with text variations for proctology check
;
PROCTOLOGY_CHECK := [
    [
        text("/me діста{в|ла} з кейсу стерильні рукавички і наді{в|ла} їх на обидві руки"),
        text("/me взявши операційну маску в руки, наді{в|ла} її на голову", 2000),
        text("/me розпакува{в|ла} стерильний анускоп", 2000),
        text("/me помічає нервовий вираз обличчя пацієнта", 2000),
        screenshot(),
        text("/me застосува{в|ла} змазку для забезпечення комфорту та зменшення болю.", 2000),
        text("/me проходить до огляду кишківника за допомогою анускопу.", 2000),
        text("/me Обережно вставляє анускоп в анус пацієнта та робить огляд кишківника.", 2000),
        text("/try патології виявлені", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for fluorography analysis
;
ANALYSIS_FLUOROGRAPHY := [
    [
        text("/me підготовлює апарат для флюорографії та перевіряє його на справність."),
        text("/do Апарат для проведення флюорограії справний", 2000),
        text("/me вказує пацієнту на необхідні заходи безпеки та комфорту під час процедури.", 2000),
        text("/me надає інструкції пацієнту щодо утримання дихання та позиціонування тіла.", 2000),
        screenshot(),
        text("/me починає зйомку зображень.", 2000),
        text("/do Апарат для проведення флюорограії проводить зйомку", 2000),
        text("/me переконується, що всі необхідні анатомічні деталі на них відображені чітко.", 2000),
        screenshot(),
        text("/do зображеня флюорографії виведено на екран", 2000),
        text("/me проводить аналіз результатів.", 2000),
        text("/try патології виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for xray analysis
;
ANALYSIS_X_RAY := [
    [
        text("/me підготовлює апарат для рентгенографії та перевіряє його на справність."),
        text("/do Апарат для проведення рентгенографії справний", 2000),
        text("/me вказує пацієнту на необхідні заходи безпеки та комфорту під час процедури.", 2000),
        text("/me надає інструкції пацієнту щодо утримання дихання та позиціонування тіла.", 2000),
        screenshot(),
        text("/me починає зйомку зображень.", 2000),
        text("/do Апарат для проведення рентгенографії проводить зйомку", 2000),
        text("/me переконується, що всі необхідні анатомічні деталі на них відображені чітко.", 2000),
        screenshot(),
        text("/do рентгенівський знімок виведено на екран", 2000),
        text("/me проводить аналіз результатів.", 2000),
        ; text("/try патології виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for DNA analysis
;
ANALYSIS_DNA := [
    [
        text("/me підготовлює необхідні матеріали та реагенти для проведення ДНК тестування та аналізу."),
        text("/me збирає зразки ДНК від пацієнта за допомогою ватного тампона.", 2000),
        text("/me вкладає зібрані зразки до апарату для проведення аналізу.", 2000),
        text("/do процес аналізу ДНК в процесі.", 2000),
       ;text("/me аналізує отримані результати та декодує генетичні характеристики пацієнта.", 2000),
        screenshot(),
    ]
]



; ====================================================================
; Creates a map with defined text, delay_before and delay_after
;
text(text, delay_before := 0, delay_after := 0) {
    return Map(
        "type", "text",
        "text", text,
        "delay_before", delay_before,
        "delay_after", delay_after
    )
}


; ====================================================================
; Creates a map with delay type
;
delay(timeMs) {
    return Map(
        "type", "delay",
        "delay_before", timeMs
    )
}


; ====================================================================
; Creates a map with screenshot type
;
screenshot(delay_before := 0, delay_after := 0) {
    return Map(
        "type", "screenshot",
        "delay_before", delay_before,
        "delay_after", delay_after
    )
}
