; ====================================================================
; Array with text variations for stomatology check
;
STOMATOLOGY_TOOTH_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 2000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для огляду ротової порожнини", 2000),
        text("/me тримає в руках шпатель і дзеркало.", 2000),
        text("/me оглядає загальний стан щелепи пацієнта при зімкнутих зубах.", 2000),
        text("/me піднімає стоматологічним дзеркалом розслаблену нижню і верхню губу.", 2000),
        text("/me злегка відтягуює щоку пацієнта, обстежучи переддень рота.", 2000),
        text("/try Червоні облямівки виявлено", 3000),
        text("/try Проблеми в куточках роту виявлено", 2000),
        text("/try Набряки та припухлість виявлено", 2000),
        screenshot(),
        text("/me переходить до ретельного огляду кожного зуба.", 2000),
        text("/me обережно поветртає голову пацієнта в зручніше положення для огляду.", 3000),
        text("/me легенько піднімаючи верхню губу за допомогою шпателя, оглядає фронтову частину верхнього ряду зубів.", 1500),
        text("/me бере із лотку з інструментами гострий зонд для перевірки якості емалі.", 3000),
        text("/me тримає в руках гострий зонд.", 3000),
        text("/me легенько проводить гострим кінчиком зонду по емалі кожнго зуба.", 3000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок верхнього ряду зубів.", 3000),
        text("/try Каріозні прояви виявлено", 3000),
        screenshot(),
        text("/do Стан зубів верхнього ряду у пацієнта задовільний", 3000),
        text("/me продовжує огляд.", 3000),
        text("/me легенько піднімаючи нижню губу за допомогою шпателя, оглядає фронтову частину нижнього ряду зубів.", 3000),
        text("/me обережно проводить гострим кінчиком зонду по емалі кожнго зуба.", 3000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок нижнього ряду зубів.", 3000),
        text("/try Каріозні прояви виявлено", 3000),
        text("/do Стан зубів нижнього ряду у пацієнта задовільний", 3000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology brackets check
;
STOMATOLOGY_BRACKETS_CHECK_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 2000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для огляду ротової порожнини", 3000),
        screenshot(),
        text("/me тримає в руках шпатель і дзеркало.", 2000),
        text("/me оглядає загальний стан щелепи пацієнта при зімкнутих зубах.", 2000),
        text("/me піднімає стоматологічним дзеркалом розслаблену нижню і верхню губу.", 3000),
        text("/me злегка відтягуює щоку пацієнта, обстежучи переддень рота.", 2000),
        text("/me переходить до ретельного огляду кожного зуба.", 2000),
        text("/me обережно поветртає голову пацієнта в зручніше положення для огляду.", 3000),
        text("/me легенько піднімаючи верхню губу за допомогою шпателя, оглядає фронтову частину верхнього ряду зубів.", 2000),
        text("/me бере із лотку з інструментами гострий зонд для перевірки якості емалі.", 2000),
        text("/me тримає в руках гострий зонд.", 3000),
        screenshot(),
        text("/me легенько проводить гострим кінчиком зонду по емалі кожнго зуба.", 2000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок верхнього ряду зубів.", 2000),
        text("/do Каріозні прояви не виявлено", 3000),
        text("/do Стан зубів верхнього ряду у пацієнта задовільний", 2000),
        text("/me продовжує огляд.", 2000),
        text("/me легенько піднімаючи нижню губу за допомогою шпателя, оглядає фронтову частину нижнього ряду зубів.", 3000),
        text("/me обережно проводить гострим кінчиком зонду по емалі кожнго зуба.", 2000),
        text("/me вводить дзеркальце в ротову порожнину пацієнта для огляду задніх стінок нижнього ряду зубів.", 3000),
        text("/do Каріозні прояви не виявлено", 3000),
        text("/do Стан зубів нижнього ряду у пацієнта задовільний", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology tooth cleaning
;
STOMATOLOGY_TOOTH_CLEANING_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 3000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/me проводить огляд для оцінки та стану зубів і ясен, щоб зрозуміти масштаб роботи та визначити необхідні методи.", 3000),
        text("/do Шприц з розчином анестезії лежить на столі", 2000),
        text("/me дістає з шухляди одноразові голки.", 2000),
        text("/me вставляє голку в шприц з розчином анестезії.", 3000),
        screenshot(),
        text("/me обережно піднімаючи верхню губу стоматологічним дзеркалом, вводить голку в верхнє ясно над шостим зубом зліва.", 2000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/me піднімає дзеркалом верхню губу пацієнта з правої сторони.", 2000),
        text("/me обережно вводить голку в ясно над шостим верхнім зубом.", 3000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/me повторює процедуру на нижній щелепі пацієнта.", 2000),
        text("/do Анестезія введна успішно.", 3000),
        text("/do Слиновідсмоктувач підключений до бор-машини.", 2000),
        text("/me згинає трубку слиновідсмоктувача в  зручне положення.", 2000),
        text("/me встановлює трубку слиновідсмоктувача у рот пацієнта.", 3000),
        text("/me готується до механічної чистки ультразвуком.", 2000),
        text("/me одягає пластикові захисні окуляри.", 2000),
        screenshot(),
        text("/do В бор-машину підключений ультразвуковий скалер із металевою насадкою", 3000),
        text("/me за допомогою апарату починає дію безпосередньо на поверхню емалі.", 2000),
        text("/me починає очищення ясенних кишень.", 2000),
        text("/do Затверділі відкладення дробляться на дрібні фрагменти, які виводяться через слиновідсмоктувач", 3000),
        text("/me прибирає в сторону ультразвуковий скалер із металевою насадкою.", 2000),
        text("/me підготовлює інструменти для видаленням м'ягкого нальоту методом Air Flow.", 2000),
        text("/me готує суміш, що складається з води та круглих гранул кальцію і м’якого порошку гліцину.", 3000),
        text("/me за допомогою спеціального апарату на поверхню зубів потужним струменем розпорошує суміш.", 2000),
        text("/me підбирає рівень абразивності пилки.", 2000),
        text("/me знімає суміш з зубів за допомогою спеціальновизначених насадок.", 3000),
        text("/me поліруює емаль кожного зуба спеціальною пастою, яка також профілактує утворення нальоту.", 2000),
        text("/me наносить спеціальний гель зі фтором для зміцнення зубів.", 2000),
        text("/do Професійна чистка завершена успішно", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology tooth removal
;
STOMATOLOGY_TOOTH_REMOVAL_VARIATIONS := [
    [
        text("/do Підготовка до прийому. Чиста хірургічна одежа та рукавички надіті"),
        text("/me входить у стоматологічну залу та вмикає світло над пацієнтом.", 3000),
        text("/me допомагає пацієнту правильно сісти в кріслі.", 2000),
        text("/me налаштовує крісло з пацієнтом в зручне для роботи положення.", 2000),
        text("/me проводить огляд для оцінки та стану зуба, щоб зрозуміти масштаб роботи.", 3000),
        text("/do Слиновідсмоктувач підключений до бор-машини.", 2000),
        text("/me згинає трубку слиновідсмоктувача в  зручне положення.", 2000),
        text("/me встановлює трубку слиновідсмоктувача у рот пацієнта.", 3000),
        screenshot(),
        text("/do В спеціальному лотку лежать необхідні та  простерилізовані інструменти для операції", 2000),
        text("/me тримає в руках щипці та тампонаду.", 2000),
        text("/me встановлює тампонаду між щокою та яснами пацієнта.", 3000),
        text("/do Шприц з розчином анестезії лежить на столі.", 2000),
        text("/me дістає з шухляди одноразові голки.", 2000),
        text("/me вставляє голку в шприц з розчином анестезії.", 3000),
        text("/me обережно піднімаючи губу стоматологічним дзеркалом, вводить голку в ясно над зубом.", 2000),
        text("/me легенько натискає на шприц і поволі вводить анестезію.", 2000),
        text("/do Анестезія введна успішно.", 3000),
        screenshot(),
        text("/me перевіряє чутливість навколо зуба гострим зондом.", 2000),
        text("/me від'єднує кругову зв'язку кореня за допомогою спеціальних інструментів.", 2000),
        text("/me накладає щічки щипців на зуб.", 3000),
        text("/me просуває щічки щипців до емалевоцементної границі.", 2000),
        text("/me змикає ручки щипців всіма п'ятьма пальцями руки.", 3000),
        text("/me починає вихитувати зуб для видалення із лунки.", 2000),
        text("/do Зуб видалено", 4000),
        text("/me здавлює краї вивільненої лунки.", 3000),
        text("/me вкладає ватний тампон, який затискає всередині.", 2000),
        text("/me починає кюретаж лунки і ушивання.", 3000),
        text("/me завершує процедури, які забезпечать чистоту лунки зуба після видалення і швидке загоєння.", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for tooth X-RAY
;
STOMATOLOGY_TOOTH_X_RAY := [
    [
        text("/do Прилад для рентгенової панорами стоїть біля бор-машини"),
        text("/me піднімає спинку крісла на 90°.", 2000),
        screenshot(),
        text("/me встановлює над пацієнтом ортопантомограф.", 3000),
        text("/me встановлює необхідні параметри програми.", 2000),
        text("/me запускає рентген-апарат.", 3000),
        screenshot(),
        text("/do Рентгенівська трубка обертається і взаємодіє з датчиком", 2000),
        text("/do Трубка зчитує необхідну інформацію і після обробки спеціальною програмою виводить готове зображення на екран", 3000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology bracket setup
;
STOMATOLOGY_BRACKETS_SETUP := [
    [
        text("/me прибирає ортопантомограф від пацієнта."),
        text("/me повертає крісло в зручне положення для подальшої роботи.", 2000),
        text("/me поправляє голову пацієнта.", 3000),
        text("/me направляє світло на щелепу пацієнта.", 2000),
        screenshot(),
        text("/me поверхнево промиває ірригатором ротову порожнину пацієнта.", 2000),
        text("/me встановлює роторозширювач до рота пацієнта.", 3000),
        text("/me готує необхідні інструменти для установки керамічної брекет-системи.", 2000),
        text("/do На столі лежать стоматологічні щипці, спеціальний клей та лоток з замочками", 2000),
        text("/me починає установку брекетів.", 3000),
        screenshot(),
        text("/me з'єднує замочки між собою ортодонтичними дугами.", 2000),
        text("/me на задні зуби фіксує щічні замки та ортодонтичні кільця.", 2000),
        text("/do Керамічна брекет-система успішно встановлена", 2000),
        screenshot()
    ]
]


; ====================================================================
; Array with text variations for stomatology tooth heal
;
STOMATOLOGY_TOOTH_HEAL := [
    [
        text("/me підходить до пацієнта зі спеціальними інструментами та матеріалами для пломбування."),
        text("/me прошу пацієнта відкрити рот і уважно оглядаю зуб, що потребує лікування.", 3000),
        text("/me підготовлює інструменти для очищення карієсу та пломбування зуба.", 2000),
        screenshot(),
        text("/me починає з обробки карієсованої ділянки, використовуючи зубні бори та інші інструменти.", 2000),
        text("/me обережно очищає пошкоджену ділянку від карієсу та збирає видалені матеріали.", 3000),
        text("/me використовує спеціальну композитну суміш для пломбування та наносить її на підготовлену поверхню зуба.", 2000),
        text("/do Композит нанесений на пошкоджену ділянку забезпечує правильну форму та текстуру пломби", 2000),
        screenshot(),
        text("/me закінчує пломбування, обробляючи пломбу спеціальними інструментами для видалення нерівностей.", 3000),
        text("/me перевіряє пломбу за допомогою зубного дзеркала, щоб переконатися, що вона правильно встановлена та не завдає дискомфорту.", 2000),
        text("/do Пломба вставновлена корректно, зуб повністню відновлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for otalaryngology rhinoscopy
;
OTOLARYNGOLOGY_RHINOSCOPY := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/me підходить до пацієнта.", 3000),
        text("/do На голові медицинська шапочка з ліхтариком.", 2000),
        text("/me встановлює розширювач для ніздрів пацієнту", 3000),
        screenshot(),
        text("/do На столі лежить носове дзеркальце.", 2000),
        text("/me бере дзеркальце в руки і починає риноскопію.", 2000),
        text("/try Носові проходи відповідають нормам", 3000),
        text("/try Патології виявлено", 2000),
        screenshot(),
        text("/me прибирає носове дзеркальце на стіл.", 3000),
        text("/me знімає розширювач з носу пацієнта.", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for otalaryngology endoscopy
;
OTOLARYNGOLOGY_ENDOSCOPY := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/me підходить до пацієнта.", 2000),
        text("/do Ендоскоп підключений до комп'ютера і передає зображення на екран.", 3000),
        text("/me починає проводити орофарінгоскопію.", 2000),
        screenshot(),
        text("/me згинає у відповідних місцях ендоскоп і вводить в середину горла пацієнта.", 3000),
        text("/do На екрані зображено збільшене в декілька разів зображення горла", 2000),
        text("/me оцінює стан пацієнта.", 3000),
        text("/try Аденоїди в нормі", 2000),
        screenshot(),
        text("/try Почервоніння виявлено", 3000),
        text("/try Патології виявлено", 2000),
        text("/me обережно витягує ендоскоп з горла пацієнта.", 3000),
        text("/me передає серветки і склянку з водою пацієнту.", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for otalaryngology otoscopy
;
OTOLARYNGOLOGY_OTOSCOPY := [
    [
        text("/do Підготовка до прийому. Чистий білий халат та рукавички одягнені."),
        text("/me підходить до пацієнта.", 2000),
        text("/do Отоскоп підключений до комп'ютера і транслює зображення на екран", 3000),
        text("/me починає отоскопію.", 2000),
        screenshot(),
        text("/me проводить отоскоп глибше в середину вуха.", 2000),
        text("/do На екрані транслюється збільшене в декілька разів зображення вуха зсередини", 2000),
        text("/me оцінює рухомість барабанної перетинки, її колір і загальний стан.", 3000),
        screenshot(),
        text("/try Рухомість барабанної перетинки в нормі", 2000),
        text("/try Колір барабанної перетинки в нормі", 3000),
        text("/try Загальний стан барабанної перетинки в нормі", 2000),
        text("/me витягує отоскоп з вуха пацієнта.", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology check variations
;
GYNECOLOGY_PREPARE_VARIATIONS := [
    [
        text("/me підійш{ов|ла} до раковини та ретельно вими{в|ла} руки"),
        text("/do На столі стоять стерильні сухі серветки", 1000),
        text("/me взя{в|ла} серветку та витер{|ла} руки", 2000),
        text("/do На столі поряд з раковиною стоїть упаковка з новими рукавичками, та одноразовими масками для обличчя", 1000),
        text("/me взя{в|ла} рукавички в руки та одягну{в|ла} їх", 2000),
        text("/me взя{в|ла} стерильну маску зі столу та одягну{в|ла} її на обличчя", 2000),
        text("/do Лікар використав антисептик щоб обробити руки в рукавичках", 3000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology check variations
;
GYNECOLOGY_PREPARE_VARIATIONS := [
    [
        text("/me підійш{ов|ла} до раковини та ретельно вимив руки"),
        text("/do На столі стоять стерильні сухі серветки", 2000),
        text("/me взя{в|ла} серветку та витер{|ла} руки", 3000),
        screenshot(),
        text("/do На столі поряд з раковиною стоїть упаковка з новими рукавичками, та одноразовими масками для обличчя", 2000),
        text("/me взя{в|ла} рукавички в руки та одягну{в|ла} їх", 3000),
        text("/me взя{в|ла} стерильну маску зі столу та одягну{в|ла} її на обличчя", 2000),
        text("/do Лікар використав антисептик щоб обробити руки в рукавичках", 3000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology take analysis variations
;
GYNECOLOGY_TAKE_ANALISYS_VARIATIONS := [
    [
        text("/do На столі лежить предметне скло з мазком"),
        text("/me бере підписане предметне скло з мазком.", 2000),
        text("/me кладе скло під мікроскоп.", 2000),
        screenshot(),
        text("/do Зразок вагінальних виділень лежить під мікроскопом", 2000),
        text("/me починає визначення наявності вагініту - запалення піхви.", 2000),
        text("/try Кількість плоских епітеліальних клітин в нормі", 2000),
        screenshot(),
        text("/try Кількість лейкоцитів в нормі", 2000),
        text("/try Наявність бактерій виявлено", 2000),
        text("/try Наявність грибків виявлено", 2000),
        text("/me заповнює бланк з результатами аналізу.", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology analysis variations
;
GYNECOLOGY_ANALISYS_VARIATIONS := [
    [
        text("/do На столику лежать інструменти для гінекологічного огляду, спеціальні дзеркала, шпатель для взяття мазків, гінекологічні щипці"),
        text("/me взя{в|ла} гінекологічне дзеркало та змастив гелем", 2000),
        text("/me обережно вв{ів|ела} дзеркало у вагіну", 2000),
        text("/do Дзеркало розташоване правильно", 2000),
        screenshot(),
        text("/me взя{в|ла} зі столика гінекологічний шпатель", 2000),
        text("/me обережно зібра{в|ла} клітини з поверхні шийки матки та внутрішньої частини шийки", 2000),
        text("/me нан{іс|есла} зібраний матеріал на предметне скельце", 2000),
        text("/do Зразки дослідження зібрано", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology ultrasonic start analysis variations
;
GYNECOLOGY_ULTRASONIC_START_ANALISYS_VARIATIONS := [
    [
        text("/do Апарат УЗД увімкнено"),
        text("/me взя{в|ла} банку з гелем в руку", 2000),
        text("/me видави{в|ла} невелику кількість на низ живота пацієнтки", 2000),
        text("/me взя{в|ла} датчик для проведення УЗД в праву руку", 2000),
        text("/me покла{в|ла} датчик пацієнтці на живіт, та поча{в|ла} дослідження", 2000),
        text("/do Лікар водить датчиком по животу, детально вивчаючи зображення на апараті", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology ultrasonic analysis pregnancy variations
;
GYNECOLOGY_ULTRASONIC_ANALISYS_PREGNANCY_VARIATIONS := [
    [
        text("/try вагітність виявлено", 500, 200),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology ultrasonic analysis pathology variations
;
GYNECOLOGY_ULTRASONIC_ANALISYS_PATHOLOGY_VARIATIONS := [
    [
        text("/try патологію виявлено", 500, 200),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for gynecology ultrasonic finish analysis variations
;
GYNECOLOGY_ULTRASONIC_FINISH_ANALISYS_VARIATIONS := [
    [
        text("/do Серветки лежать поруч з апаратом УЗД"),
        text("/me взя{в|ла} серветки та витер{в|ла} датчик від залишків гелю", 2000),
        text("/me постави{в|ла} датчик назад на апарат УЗД", 2000),
        text("/me переда{в|ла} серветки пацієнтці", 2000),
        text("/do Пацієнтка витерла гель із живота", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for kedney donor surgery
;
KIDNEY_DONOR_VARIATIONS := [
    [
        text("/me перевіряє статус донора та підтверджує його готовність до операції."),
        text("/me поча{в|ла} підготовку до операції.", 2000),
        text("/do На столі заготовлені необхідні хірургічні інструменти", 3000),
        text("/me підключає пацієнта до апарату штучної вентиляції легень та моніторингу вітальних функцій.", 2000),
        text("/do Пацієнт погрузився в медикаментозний сон", 3000),
        screenshot(),
        text("/me роблить розріз по шкірі та відкривають доступ до нирки.", 2000),
        text("/do Стан нирки та задовільний", 3000),
        text("/me видаляє нирку з донора з урахуванням усіх необхідних безпечних процедур.", 2000),
        text("/me перекладає нирку в контейнер для транспортування.", 2000),
        screenshot(),
        text("/me проводить перевірку стану пацієнта.", 3000),
        text("/do Стан пацієнта задовільний.", 2000),        
        text("/me Закриває розріз та застосовує пов'язку.", 3000),
        text("/me відключає пацієнта від апарату штучної вентиляції легень.", 2000),
        text("/do Через деякий час пацієнт приходить до тями.", 3000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery preparation
;
SURGERY_PREPARATION_VARIATIONS := [
    [
        text("/me одягну{в|ла} стерильний хірургічний халат"),
        text("/me оброби{в|ла} руки дезинфікуючим розчином", 2000),
        text("/do Руки хірурга чисті", 2000),
        text("/do Упаковка з одноразовими хірургічними рукавицями стоїть на столі", 2000),
        text("/me одягну{в|ла} стерильні рукавиці та знову оброби{в|ла} руки антисептиком", 2000),
        text("/do Стерильна маска для обличчя лежить на столі", 2000),
        text("/me одягну{в|ла} маску", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery start
;
SURGERY_START_VARIATIONS := [
    [
        text("/me включи{в|ла} лампи над хірургічним столом"),
        text("/me направи{в|ла} світло на пацієнта", 2000),
        text("/do Простерилізовані хірургічні інструменти лежать на столі", 2000),
        text("/do Пацієнт на операційному столі під наркозом та підготовлений до операції", 2000),
        text("/do Операція починається", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery appendix removal
;
SURGERY_APPENDIX_REMOVAL := [
    [
        text("/me обробляє операційне поле антисептиком"),
        text("/me намічає штрихом місце розрізу", 2000),
        text("/me взявши скальпель, підносить його до штриха і починає обережно розрізати шкіру, потім м'язові волокна", 2000),
        text("/me перевіряє орган апендиксу пінцетом на цілісність", 2000),
        text("/me обережно видаляє скальпелем орган апендиклса", 2000),
        screenshot(),
        text("/me кладе орган апендикса в спеціальну металеву тару", 2000),
        text("/do На столі лежить стерильна голка та хірургічні нитки", 2000),
        text("/me взя{в|ла} голку із хірургічною ниткою зі столу", 2000),
        text("/me поча{в|ла} обережно зашивати розріз", 2000),
        screenshot(),
        text("/do Через деякий час розріз зашито", 2000),
        text("/me постави{в|ла} голку назад на столик", 2000),
        text("/me взя{в|ла} стерильну ватно- марлеву подушечку, та обережно прикла{в|ла} його до зашитого розрізу", 2000),
        text("/me лівою рукою тримаючи ватно-марлеву подушечку на рані, правою взя{в|ла} хірургічний пластир та заклеї{в|ла} рану", 2000),
        text("/do Рана зашита та оброблена", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery anasthesia
;
SURGERY_ANASTHESIA_VARIATIONS := [
    [
        text("/do Пацієнт розташований на операційному столі"),
        text("/me фіксує маску наркозно- дихального апарату на обличчі пацієнта", 2000),
        text("/me перевіряє чи добре зафіксована маска", 2000),
        text("/do На пацієнті маска, що під'єднана до наркозно- дихального апарату", 2000),
        text("/me увімкну{в|ла} апарат", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for surgery local anasthesia
;
SURGERY_ANASTHESIA_LOCAL_VARIATIONS := [
    [
        text("/do Шприц з інфільтраційною анестезією стоїть на столі"),
        text("/me взя{в|ла} шприц з анестезією та підніс до місця уколу", 2000),
        text("/me вв{ів|ела} голку у відкритий підшкірний шар, та продовжи{в|ла} просувати голку вглиб до досягнення контакту пластикової канюлі та шкіри.", 2000),
        text("/me поча{в|ла} вводити анестетик під час видалення голки", 2000),
        text("/me продовжи{в|ла} знеболювати потрібну область повторюючи дії", 2000),
        text("/do Анастезія повністю введена", 2000),
        text("/do пацієнт почав відчувати заніміння, чутливість знеболеної області поступово знижується", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for MRT processing
;
ANALYSIS_MRT_PRECESSING := [
    [
        text("/me увімкну{в|ла} керування столом апарату МРТ"),
        text("/do Стіл з пацієнтом повільно заїжджає в тунель МРТ апарату", 2000),
        text("/me включи{в|ла} апарат Магнітно Резонансної Томографії", 2000),
        text("/do Процедура триває деякий час", 2000),
        text("/do Апарат працює та передає дані на стаціонарний комп'ютер лікаря", 2000),
        text("/do Дослідження закінчено", 2000),
        text("/me виключи{в|ла} апарат МРТ", 2000),
        text("/me натисну{в|ла} кнопку управління", 2000),
        text("/do Пацієнт почав повільно виїжджати з тунелю", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for MRT results
;
ANALYSIS_MRT_RESULTS := [
    [
        text("/me взя{в|ла} чисту флешку без інформації"),
        text("/me встави{в|ла} флешку USB порт для передачі даних", 2000),
        text("/do Лікар поча{в|ла} переносити дані дослідження на флешку", 2000),
        text("/do Дія триває деякий час", 2000),
        screenshot(),
        text("/me паралельно поча{в|ла} ознайомлюватись та вивчати дані дослідження", 2000),
        text("/me детально переглянув результати МРТ дослідження", 2000),
        text("/try патологію виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for MRT print results
;
ANALYSIS_MRT_PRINT_RESULTS := [
    [
        text("/me заверши{в|ла} передачу даних на електронний носій"),
        text("/do Чистий бланк стоїть на столі", 2000),
        text("/me поча{в|ла} заповнювати бланк заключення дослідження", 2000),
        text("/me поча{в|ла} друк заключення МРТ дослідження", 2000),
        screenshot(),
        text("/do Принтер почав працювати", 2000),
        text("/do Через деякий час бланк роздруковано", 2000),
        text("/me витягну{в|ла} флешку, та взя{в|ла} готове заключення МРТ дослідження та переда{в|ла} пацієнту", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for narkologyst alko test
;
NARCOLOGYST_ALKO_TEST := [
    [
        text("/do Алкотестер `"Medicl+ Alco Control 7.0`" та набір в сумці на плечі"),
        text("/me діста{в|ла} алкотестер з сумки та встанови{в|ла} одноразову трубочку.", 2000),
        text("/do Алкотестер включений та готовий до роботи", 2000),
        screenshot(),
        text("/me протягну{в|ла} руку з тестером людині навпроти.", 2000),
        text("/do Незнайомець(ка) дмухає в алкотестер, алкотестер пищить", 2000),
        text("/try Алкотестер показав 0.0 проміле", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for narkologyst drugs test
;
NARCOLOGYST_DRUGS_TEST := [
    [
        text("/do Тест на наркотичні речовини в сумці"),
        text("/me діста{в|ла} набір для перевірки на наркотичні речовини.", 2000),
        text("/me проколо{в|ла} середній палець незнайомцю навпроти та взя{в|ла} кров на аналіз.", 2000),
        text("/try Тест на наркотики виконананий! Наркотики в крові виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for proctology meds
;
PROCTOLOGY_INSERT_MEDS := [
    [
        text("/do Сумочка проктолога у руці"),
        text("/me діста{в|ла} з кейсу стерильні рукавички і наді{в|ла} їх на обидві руки", 2000),
        text("/me відкривши відсіки кейсу, діста{в|ла} упаковку супозиторій білого кольору.", 2000),
        screenshot(),
        text("/me розкривши упаковку, взя{в|ла} одну свічку в руку", 2000),
        text("/do Свічка в руці", 2000),
        text("/me обережно, швидко і легко вв{ів|ела} свічку в пряму кишку", 2000),
        text("/try свiчка встановлена", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for hemorrhoids healing
;
PROCTOLOGY_HEMORRHOIDS_HEALING := [
    [
        text("/me взявши маску від апарату для наркозу, наді{в|ла} її на пацієнта"),
        text("/do На правому плечі висить відкрита мед. сумка", 2000),
        text("/me діставши стерильні рукавички з мед. сумки, наді{в|ла} їх на руки", 2000),
        text("/me взявши операційну маску в руки, наді{в|ла} її на голову", 2000),
        text("/do Поруч із операційним столом стоїть стійка з інструментами", 2000),
        text("/me взя{в|ла} затискач зі стійки", 2000),
        text("/me наклавши затискач на 1см від країв ануса, розтягну{в|ла} його", 2000),
        text("/me оглянувши анальний отвір, стягну{в|ла} затискач", 2000),
        screenshot(),
        text("/me прибирає затискач з країв ануса", 2000),
        text("/me починає видалення геморою", 2000),
        text("/me видаляє геморой", 2000),
        text("/do геморой видалений", 2000),
        text("/me діста{в|ла} із мед. сумки мазь `"Цікадерма`"", 2000),
        screenshot(),
        text("/me обробивши свіжий опік маззю, стягнув затискачі", 2000),
        text("/me прибра{в|ла} затискач з країв ануса", 2000),
        text("/me зня{в|ла} стерильні рукавички з рук", 2000),
        text("/me зня{в|ла} операційну маску з обличчя", 2000),
        text("/do Операція успішно завершена. Пацієнт повинен піти на реабілітацію", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for proctology enema
;
PROCTOLOGY_ENEMA := [
    [
        text("/do На плечі висить медична сумка"),
        text("/me відкри{в|ла} медичну сумку, взя{в|ла} з неї рукавички та наді{в|ла} їх на руки", 2000),
        text("/do Медичні латексні рукавички одягнені на руки", 2000),
        text("/do У шафці лежать медикаменти", 2000),
        screenshot(),
        text("/me відкри{в|ла} шафку і діста{в|ла} одноразову клізму", 2000),
        text("/do Клізма в руках", 2000),
        text("/me вiдкри{в|ла} кран з водою", 2000),
        text("/me поча{в|ла} набирати воду в клiзму", 2000),
        text("/do Клiзма набрана", 2000),
        screenshot(),
        text("/me обережно спусти{в|ла} труси пацієнта", 2000),
        text("/me встави{в|ла} шлангочку з клізми в анальний отвір", 2000),
        text("/do Шлангочка в отворі", 2000),
        text("/me поча{в|ла} потроху натискати на клізму випускаючи вміст у пряму кишку", 2000),
        text("/try фекальні виділення вийшли назовні", 2000),
        screenshot(),
        text("/me зн{в|ла}в рукавички і викинув їх у смiтник", 2000),
        text("/me відкри{в|ла} медичну сумку, взя{в|ла} з неї рукавички та наді{в|ла} їх на руки", 2000),
        text("/do Медичні латексні рукавички одягнені на руки", 2000),
    ]
]


; ====================================================================
; Array with text variations for proctology check
;
PROCTOLOGY_CHECK := [
    [
        text("/me діста{в|ла} з кейсу стерильні рукавички і наді{в|ла} їх на обидві руки"),
        text("/me взявши операційну маску в руки, наді{в|ла} її на голову", 2000),
        text("/me розпакува{в|ла} стерильний анускоп", 2000),
        text("/me помічає нервовий вираз обличчя пацієнта", 2000),
        screenshot(),
        text("/me застосува{в|ла} змазку для забезпечення комфорту та зменшення болю.", 2000),
        text("/me проходить до огляду кишківника за допомогою анускопу.", 2000),
        text("/me Обережно вставляє анускоп в анус пацієнта та робить огляд кишківника.", 2000),
        text("/try патології виявлені", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for fluorography analysis
;
ANALYSIS_FLUOROGRAPHY := [
    [
        text("/me підготовлює апарат для флюорографії та перевіряє його на справність."),
        text("/do Апарат для проведення флюорограії справний", 2000),
        text("/me вказує пацієнту на необхідні заходи безпеки та комфорту під час процедури.", 2000),
        text("/me надає інструкції пацієнту щодо утримання дихання та позиціонування тіла.", 2000),
        screenshot(),
        text("/me починає зйомку зображень.", 2000),
        text("/do Апарат для проведення флюорограії проводить зйомку", 2000),
        text("/me переконується, що всі необхідні анатомічні деталі на них відображені чітко.", 2000),
        screenshot(),
        text("/do зображеня флюорографії виведено на екран", 2000),
        text("/me проводить аналіз результатів.", 2000),
        text("/try патології виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for xray analysis
;
ANALYSIS_X_RAY := [
    [
        text("/me підготовлює апарат для рентгенографії та перевіряє його на справність."),
        text("/do Апарат для проведення рентгенографії справний", 2000),
        text("/me вказує пацієнту на необхідні заходи безпеки та комфорту під час процедури.", 2000),
        text("/me надає інструкції пацієнту щодо утримання дихання та позиціонування тіла.", 2000),
        screenshot(),
        text("/me починає зйомку зображень.", 2000),
        text("/do Апарат для проведення рентгенографії проводить зйомку", 2000),
        text("/me переконується, що всі необхідні анатомічні деталі на них відображені чітко.", 2000),
        screenshot(),
        text("/do рентгенівський знімок виведено на екран", 2000),
        text("/me проводить аналіз результатів.", 2000),
        ; text("/try патології виявлено", 2000),
        screenshot(),
    ]
]


; ====================================================================
; Array with text variations for DNA analysis
;
ANALYSIS_DNA := [
    [
        text("/me підготовлює необхідні матеріали та реагенти для проведення ДНК тестування та аналізу."),
        text("/me збирає зразки ДНК від пацієнта за допомогою ватного тампона.", 2000),
        text("/me вкладає зібрані зразки до апарату для проведення аналізу.", 2000),
        text("/do процес аналізу ДНК в процесі.", 2000),
       ;text("/me аналізує отримані результати та декодує генетичні характеристики пацієнта.", 2000),
        screenshot(),
    ]
]



; ====================================================================
; Creates a map with defined text, delay_before and delay_after
;
text(text, delay_before := 0, delay_after := 0) {
    return Map(
        "type", "text",
        "text", text,
        "delay_before", delay_before,
        "delay_after", delay_after
    )
}


; ====================================================================
; Creates a map with delay type
;
delay(timeMs) {
    return Map(
        "type", "delay",
        "delay_before", timeMs
    )
}


; ====================================================================
; Creates a map with screenshot type
;
screenshot(delay_before := 0, delay_after := 0) {
    return Map(
        "type", "screenshot",
        "delay_before", delay_before,
        "delay_after", delay_after
    )
}
